&
'be
'bout
'cause
'causec
'causin'
'cos
'dro
'em
'ey
'fore
'gon
'head
'm
'magine
'n
'na
'round
's
'til
'vette
'xcuse
+bust
,and
,but
,ran
1
12
2
2pac's
3
4
5
6
8
a
a1
ab
abide
ablaze
able
aboard
abortion
about
abracadabra
abuse
abused
abuses
accent
accents
accommodate
account
accountant
accounts
accuse
ace
ack
acquire
acquired
across
act
actin'
action
actions
activate
activated
active
actually
ad
adam
adamant
add
addicted
addicts
adidas
adjust
admiration
admired
admission
admit
admittedly
adore
adrenaline
adrock
advance
advantage
adversaries
advice
affair
affection
afflicted
afford
afraid
african
afrika
after
afternoon
again
against
age
agent
agents
ago
agree
agreed
aguilera
ah
ahead
ahh
aid
aim
ain't
aint
air
airplane
ak
aka
akon
al
aladdin
alan
alarm
album
albums
alcohol
alcoholic
ale
alert
ali
alive
alize
all
allergic
alleviate
alley
alligators
allow
almost
alone
along
alphabet's
alpine
alpine's
already
alright
also
although
aluminum
always
am
amaze
amazed
amazes
amazin'
amazing
ambien
ambition
ambulance
ame
amen
america
american
amnesia
amongst
amor
amplified
an
an'
anaconda
analysis
analyze
ance
ancient
and
andre
ands
anger
angry
animal
animals
anna
annihilate
announce
annoy
anotha
another
answer
answers
anteloups
anti
antidote
antone
any
anybody
anyday
anymore
anyone
anyplace
anythin'
anything
anytime
anyway
anywhere
apart
apartment
apartments
ape
aphrodisiac
apocalypse
apollo
apologize
appeal
appealin'
appearance
appears
apple
applyin'
appolonia
approachin'
apron
are
area
aren't
argue
arguin'
arguments
arizona
arm
armed
armor
armored
arms
around
arouse
arraignment
arrange
arrest
arrested
arrestin'
arrival
arrive
arrived
artemis
articulate
artifacts
as
ashamed
ashley
asian
aside
ask
asked
askin'
asleep
asphalt
ass
ass'll
asses
asshole
assistance
assume
at
ate
atlanta
atmosphere
attack
attackin'
attempt
attention
attire
attitude
attitude's
attractin'
attraction
audemar
audemars
audio
austin
auto
autograph
automatic
ave
average
avoid
avoids
aw
awake
award
aware
away
awesome
awful
awol
ay
ayo
b
b's
ba
babe
babies
baby
baby's
bacardi
back
back's
backed
backpack
backs
backseat
backside
backslap
backstabbin'
backstroke
backwards
backyard
bacon
bad
baddest
badonkadonk
baduh
bag
baggin'
bags
baguette
bail
bails
balcony
ball
balla
ballies
ballin'
balloon
balls
bambataa
bamboo
bananas
band
bands
bang
banger
bangin'
bank
bankhead
bankroll
banks
bap
bape
baptized
bar
bar,
barbeque
barber
barely
bargained
barkay's
barkin'
barn
barry
bars
bas
base
base's
basement
basil
basketball
bass
bass,
bastard
batch
batchler
bath
bathroom
battle
battles
battling
bay
bbc
be
be,
beach
beacon
beam
beamin'
beams
bean
beans
beast
beastie
beat
beatdown
beatin'
beating
beatnik
beats
beautiful
beauty
became
because
becca
become
becomin'
becoming
bed
bedroom
bedrooms
beef
beef,
been
beeped
beeper
beepin'
beer
beers
bees
befo'
before
beg
began
beggars
begged
beggin'
begi
begin
beginner
beginning
begun
behave
behind
behold
bein'
being
beings
believe
believed
bell
bells
belly
belong
belt
belve
belvedere
belvederes
bend
bending
bends
benjamins
bent
bentley
benz
benz's
benzos
bernard
beroni
berry
berserk
beside
besides
best
bet
betcha
betta
better
between
beverage
beware
beyond
bi
bib
bible
bic
bid
big
bigger
biggie
bike
bill
billboard
billion
bills
bimbos
binge
biotch
bird
birds
birth
birthday
birthdays
birthed
bit
bitch
bitch,
bitches
bite
bitter
bittersweet
bitty
biz
bizarre
bizzack
black
blacks
blah
blame
blank
blaow
blast
blaster
blastin'
bleed
bleedin'
bless
blessed
blessin'
blew
blimp
blind
blinded
blinders
blindin'
bling
blinkin'
bliss
block
blocks
blonde
blood
bloodshot
blouse
blow
blowin'
blown
blows
blue
blueberry
bluer
blues
blunt
blunts
blurry
blurt
bm's
bo
boarder
boast
boat
bob
bodied
bodies
bodily
body
body's
bodygaurds
bodyslam
bold
bolder
bollywood
bomb
bomb,
bombed
bombs
bone
bones
bong
boo
booed
boogaloo
boogie
boogies
book
books
bookworms
boom
boomin'
boone
boot
booth
bootie
booties
boots
booty
booyaka
booze
bop
boppa
border
bore
bored
borin'
boring
born
borrowed
boss
bossy
both
bother
bothered
bots
bottle
bottles
bottom
bought
bougie
bounce
bouncers
bouncin'
bound
bounds
bout
bow
bowels
bows
bowzer
box
boxers
boy
boy's
boyfriend
boyfriend's
boys
bra
brady
brag
braggin'
braided
braids
brain
brains
brakes
brand
bras
brass
brazil
brazilian
brazils
bread
breadwinner
break
breaker
breakfast
breakin'
breaks
breast
breasts
breath
breathe
breathin'
breed
breeze
breezy
brews
brick
bricks
bride
bridesmaid
bridge
brief
bright
bring
bringin'
brings
britney
brizzles
bro
broads
broadway
broke
broken
bronx
brooklyn
brother
brothers
brougham
brought
brown
bruce
brucey
bruise
bruised
bruises
brunches
brutally
bub
bubba
bubble
bubblin'
bubonic
bucks
bud
buddha
buffalo
bug
buggin'
build
buildin'
building
built
bull
bullcrap
bullet
bulletproof
bullets
bullied
bullshit
bum
bump
bumper
bumpin'
bumrushed
bunch
bunnies
buns
burberry
burger
buried
burn
burned
burners
burnin'
burning
burnt
burp
burst
bury
bus
buse
bush
busily
business
bussin'
bust
busta
busted
buster
busters
bustin'
busy
but
buts
butt
butter
buttercrunch
buttered
butterfly
buttons
butts
buy
buyin'
buzz
buzzed
by
bye
bygones
bypass
bys
c
c'mon
c's
cab
cabbage
cable
cadilac
cadillac
cafeteria
caged
cake
cal
calculated
cali
cali's
californ
california
californicatin'
call
called
callin'
calling
calls
calm
calmly
calories
came
camel
camera
cameras
camp
campaign
campus
can
can't
cancer
candle
candles
candy
cannibals
cannot
cans
cantaloupes
canyon
cap
capital
capitalist
capped
cappin'
caprese
capri
capricorn
captain
captivatin'
captivating
capture
car
car's
caramel
card
cardio
cards
care
career
careful
cares
caress
cargo
carin'
carol
carpet
carried
carrots
carry
cars
carson
carter
cartier
casanova
case
cash
cashier
casino
cast
casted
castle
casually
casualties
cat
catastrophe
catch
catchin'
cats
caucasians
caught
cause
causin'
caution
cd
cd,
cease
cee
ceilin'
ceilings
celebratin'
celibate
cell
cellular
celly
celtics
cemetery
censor
center
centers
centre
cents
ceo
ceremony
certain
certified
ch
cha
chachi
chain
chains
chair
chairs
chalk
champagne
champaign
champale
champion
championship
chan
chance
chances
chanel
change
changed
changer
changin'
channel
charge
chargin'
charles
charlie
charm
chart
charts
chase
chasin'
chat
chauffeur
cheap
cheaper
cheat
cheatin'
cheating
check
checkbook
checkbooks
checked
checker
checkin'
checks
cheddar
cheech
cheek
cheeks
cheer
cheese
cheetah
cherries
cherry
chest
chevy
chewed
chewin'
chi
chick
chicken
chicken's
chicks
chief
chiefin'
chigga
child
child's
children
children's
chill
chillin'
chillion
chills
chilly
chimney
china
chinchilla
chinchillas
chinese
chipped
chivas
chloe
cho
chocolate
choice
choir
choke
choked
chokin'
chong
choose
choosin'
choosy
chop
chopped
chopper
choppin'
chords
chorus
chose
chosen
christian
christina
christmas
chro
chrome
chronic
chuck
chucks
chump
chumps
chunk
church
cia
ciga
cigar
cinder
cinnabon
circle
circles
circling
circus
city
city's
civilian
civilized
clack
clad
claim
claimed
claimin'
clampett
clap
clappin'
clapping
clark
clashin'
class
classes
classic
classics
classroom
claw
clean
cleaner
cleanin'
clear
clearly
click
client
clientele
climax
climb
climbin'
cling
clinton
clip
clique
clitoris
clock
clock's
clockin'
clogged
close
closed
closer
closet
closure
clothes
clothin'
cloths
cloudy
clout
clown
clowns
club
clubs
clue
clutch
clyde
co
coach
coast
coaster
coat
cocaine
cock
cocked
cocky
code
codeine
codes
coffee
coffins
coils
coincidental
coke
cokes
cold
cole
collar
collard
collection
college
collide
color
colorado
colors
comb
combined
come
comedy
comes
comfortable
comin'
coming
command
commanding
commentary
commercial
committed
committing
common
comp
compact
companion
compare
compared
competition
competitors
complainin'
complements
complete
compliments
compose
comprehend
compton
con
conceal
concept
concerned
concert
concussion
condition
condo
condos
confess
confidant
confirmed
conflict
confuse
confused
confusing
confusion
congress
conjurin'
conkin'
conquer
conscience
consequences
consider
considerate
considered
constant
consume
contact
contagious
contemplate
content
continental
continue
continued
contraceptive
contrary
contribution
control
controllin'
controls
controversy
convent
conversate
conversations
convicted
coochie
coogi
cook
cookie
cookies
cookin'
cooking
cookouts
cool
coolin'
coordinate
cooter
cop
cope
copin'
copit
coppa
copped
coppers
cops
copy
core
corner
cornered
corners
corny
correct
cos
cosmo
cost
cot
cotton
could
could've
coulda
couldn't
counter
counterfeit
country
counts
coup
coupe
coupin'
couple
courage
course
court
courtroom
courts
cousin
cover
cowards
cowboys
coz
cozy
crab
crack
cracked
crackers
crackin'
cracks
craig
crank
crap
crashin'
crater
craters
crave
crawl
cray
craze
crazier
crazy
cream
creams
create
created
credit
creek
creep
creepin'
cret
crew
crew's
crews
crib
crib,
cribs
cries
crime
criminals
crip
cris
crist
cristal
cristal's
cristo
criteria
critics
crizz
crizzin'
croak
crocker
crocodile
crop
crops
cross
crossed
crowd
crowded
crowds
crown
crowned
cruise
cruise,
cruisin'
crumble
crunch
crunk
crush
crushed
crushin'
cruzin'
cry
cryin'
crying
cs
cuba
cuban
cubans
cube
cubes
cuckoo
cue
cuervo
cultivating
culture
cum
cup
cupid
cups
curb
cure
curious
curls
curly
currents
curse
cursed
curtains
curves
cushman
cuss
cussing
custody
customary
cut
cute
cutie
cuties
cuts
cutta
cutter
cuttin'
cuz
cybertron
cypher
cyrus
d
d's
da
dabbled
dad
daddy
daily
daises
dali
daly
dame
dames
damn
damnit
damon
damp
damsel
dance
dance,
danced
dancefloor
dancin'
dancing
dane
danger
dangerous
danglin'
daniel
dank
dantley
dare
dark
darren
darryl
daryll
dash
dat
date
datin'
datsun
daughter
daughter's
daughters
dave
dawg
dawkins
dawn
dawnin'
day
daylight
days
dc
de
dead
deal
dealer
dealin'
dear
death
debonoir
debt
dec
decade
deceased
deceitful
deceive
decency
decided
decision
decline
dedicated
dee
deep
deeper
def
defeat
defend
defenders
defendin'
defiant
define
definitely
definition
degrees
deja
delaware
deleted
delight
deliver
delores
dem
demand
demanding
demarco
demeanor
demo
democrat
demon
demons
den
deni
denial
deniro
denis
dense
dent
deny
depicted
deposit
depositin'
depressed
depression
deputy
deranged
derek
dermatology
derrick
derriere
deserve
deserves
design
designed
designer
desire
desist
despair
desperado
desperate
despite
destiny
destiny's
destroy
detectors
determined
detroit
deuce
devastating
devil
devious
devoured
dey
di
diagnosin'
dial
dialin'
diamond
diamonds
diapers
dibbie
dice
dick
dick's
dickin'
dicks
dicky
dictionary
did
didc
didn't
die
died
diego
dies
diet
difference
different
differently
dig
digger
diggers
digital
digits
dike
dime
dimensions
dimes
dimp
dine
dinero
dinner
dior
dip
dippa
dippin'
direction
dirt
dirty
dirty,
dis
disarray
disaster
disc
disco
disconnect
discoteque
discouraged
discovery
discrimination
discuss
discussion
disease
dish
dishes
disillusioned
dismissed
disown
dispensin'
displays
disrespect
disrupt
diss
dissed
dissin'
distant
distractin'
distraction
distracts
distress
disturb
disturbed
disturbin'
ditty
dive
divided
divorce
dizz
dizzle
dizzy
dj
dj's
dk
do
do'
doc
doc's
doctor
doctor's
doctors
dodi
doe
does
doesn't
dog
dogg
doggy
dogs
doh
doin'
doing
dolce
dole
dolja
doll
dolla
dollar
dollars
dollas
dolomite
dolphins
dom
dome
domestic
dominicano's
domino
don
don't
don'tcha
done
doner
donk
donnie
doo
dookie
door
doorknobs
doors
dope
dope,
dorado
dorm
dorothy
dose
double
doubleu
doubt
douch
dough
doughnut
doughs
douse
dove
down
down,
downfall
download
downtown
dracula
draft
drag
dragged
draggin'
drake
drama
drankin'
drastic
draw
drawers
drawin'
drawn
dre
dre's
dream
dreamin'
dreams
dress
dress,
dressed
dresses
dressin'
drew
dribble
drink
drinkin'
drinking
drinks
drip
drippin'
dripping
drive
driven
driver
driveway
drivin'
driving
dro
drop
dropped
droppin'
drops
drown
drug
drugs
drum
drummer
drums
drunk
dry
dryer
drywall
ds
dub
dublin
dubs
ducats
duce
duckin'
ducks
dude
dude's
dudes
due
duh
duke
dum
dumb
dummies
dump
dumpin'
duncan
dunk
dunked
dunks
durst
dutch
duty
dwayne
dwell
dwelled
dy
dyin'
dynamite
e
e'ery
e'rything
each
eager
ear
eardrum
eargasm
earl
early
earn
earned
earnin'
ears
earth
ease
easily
east
eastside
easy
eat
eatin'
eating
ecstacy
ecstasy
ed
eddie
edge
educated
education
educator
eebi
effect
effects
eggs
ego
eh
eiffel
eight
eighteen
eighteenth
eighth
eightoheight
eightoneeight's
eighty
eightyeight
einstein
either
el
electric
electrician
electro
elementary
elev'
eleven
eleventh
eligible
ella
elliot
elope
else
elvis
em
embed
embrace
emcee
emcees
emd
emerge
eminem
emotions
empire
emptiness
empty
encounter
end
ended
endin'
endless
ends
endure
enemies
enemployed
engineer
enough
enslave
enter
enterprisin'
entertain
entertainin'
entertainment
enthesiology
enticin'
entire
entrance
entry
envy
ep
episode
equals
equipped
er
era
erase
erased
erection
erica
erotic
ers
erykah
es
escalade
escape
escaped
escapin'
escaping
escargot
estate
et
eternal
europeans
ev'ry
eve
even
evenin'
evening
events
ever
every
everybody
everybody's
everyday
everythin'
everything
everything's
everywhere
evident
evil
ewing
ex
exactly
excel
excellence
except
excercise
excitement
excuse
excuses
exhale
exorcist
expect
expensive
experience
experienced
explain
explained
explode
express
expressway
exquisite
exstacy
extending
extensive
exterior
extortion
extra
extreme
eye
eyeball
eyes
eyesight
f
fables
fabulous
face
faces
facin'
facing
fact
factories
facts
fad
fade
faded
fag
faggot
fail
failed
fails
failure's
fair
fairy
fake
fakin'
fall
fallin'
false
fam
fame
family
family's
famous
fan
fan,
fangs
fans
fantasies
fantasy
fantasy's
far
farm
farrah
farther
fashion
fast
fastened
faster
fat
fatburger
father
father's
fats
fatso
fatter
faucet
fault
faults
favorite
fawcett
faze
fear
fears
february
fed
federal
fee
feed
feedin'
feel
feelin'
feeling
feelings
feelins'
feels
feet
fell
fella
fellas
fellow
felon
felons
felt
female
females
feminist
fendi
ferrari
fess
fever
few
fi
field
fiend
fiendin'
fiends
fifteen
fifth
fifty
fight
fight's
fightin'
fights
figment
figure
figures
file
fill
filled
fillet
fillin'
filth
filthy
fin
finally
find
fine
finer
finesse
finest
finga
finger
fingers
finish
finished
fins
fire
firecracker
fired
firing
firm
first
first,
fish
fishbowl
fishin'
fist
fit
fits
fitted
fittest
five
fix
fixed
fizz
flag
flagrant
flame
flames
flash
flashes
flashin'
flat
flatten
flaunt
flaunted
flavor
flay
flex
flicks
flight
flintstone
flip
flipped
flippin'
flirt
flirting
fliz
flo
flo'
floatin'
flock
floor
floors
flop
flopped
floss
flossin'
flow
flower
flowers
flowin'
flows
floyd
flu
flurry
fly
flyin'
fo
fo'
focus
focused
foe
foes
fog
foil
folds
folklore
folks
follow
followers
follows
fonda
food
food's
fool
fooled
foolery
foolin'
foolish
fools
foot
foots
for
force
forced
fore
forehead
foreign
foreigners
foreman
foreplay
forever
forfeit
forget
forgetting
forgin'
forgive
forgiveness
forgot
form
formalities
format
formulate
forsaken
forte
forth
fortune
forty
fortyeight
fortyseven
forwards
fought
found
four
fours
fourth
fox
foxy
frame
france
frank
frankie
freak
freakin'
freaks
freaky
fred
freddy
free
freeway
freeze
freind
french
frequently
fresh
freshest
friction
friday
fried
friend
friend's
friendly
friends
friendship
fries
frisco
from
front
frontin'
fronts
frost
froze
frozen
fruit
fruits
frustration
fry
fuck
fucked
fucker
fuckers
fuckin
fuckin'
fucking
fucks
fuel
fuh
fulfill
full
fully
fun
function
funk
funked
funkmaster
funky
funny
furnace
furniture
fuse
fuss
fussin'
fussing
future
futuristic
fuzz
fuzzy
g
g'd
g's
gab
gabana
gain
gal
gallery
gamble
gambler
gamblin'
game
game's
games
gang
gangs
gangsta
gangstas
gangster
gangsters
gaping
garbage
garden
gary
gas
gassed
gassin'
gat
gate
gates
gather
gato
gator
gators
gats
gaul
gave
gawd
gawking
gazin'
gear
gee
geico
gem
genesis
genius
genocidal
gentle
gently
genuine
george
georgia
germs
get
gets
getta
getter
gettin'
getting
ghetto
ghost
gi
giant
giddy
gie
gift
gig
giggled
giggling
gigolo
gimme
gin
ginst
gipp
girl
girl's
girlfriend
girlie
girlies
girls
giselle
git
give
given
gives
givin'
gizz
gizzo
glad
glades
glance
glanced
glancin'
glass
glasses
gleam
gleamin'
glee
glide
glidin'
glisten
global
globe
globetrotter
glock
glocks
gloomy
gloss
glove
gloves
glow
go
goals
gobi
goblin
god
goddamn
godfather
goes
gogh
goin'
going
gold
goldie
gon
gon'
gone
gonna
good
goodbye
goodness
goods
goodyear
goofy
goon
goons
goose
gorilla
gorillas
gospel
got
gotcha
gots
gotta
gotten
grab
grabbed
grabbin'
grace
gracious
grade
gradually
graduated
graduation
graffiti
grammar
grammie
grammy
grams
grand
grandchild
grandmaster
grands
granny
granted
grape
gras
grasp
grass
gravity
gravy
gray
graze
greasy
great
greater
greatest
greatness
gree
greed
greedy
green
greene
greenery
greens
greg
grew
grey
grill
grilled
grills
grimey
grin
grind
grindin'
grip
grip,
gripped
grips
grit
grits
grittin'
gritty
griz
groomed
groove
grooves
groovin'
groovy
ground
ground,
grounded
group
groupies
groups
groupy
grove
grow
growin'
grown
grows
gs
guap
guarantee
guaranteed
guard
guards
gucci
guess
guest
guile
guilty
gulls
gully
gulp
gum
gumbo
gun
gunnin'
gunplay
guns
gunsmoke
gushin'
gut
guts
gutter
guy
guys
gwen
gym
gypsy
h
ha
had
haha
hail
hair
hairnet
hairy
half
hall
halle
hallin'
halls
hamil
hammer
hammer's
hammers
hand
handcuffs
handed
handle
handled
handles
handlin'
hands
handsome
handy
hang
hangin'
hanging
hangout
hank
hap
happen
happened
happenin'
happening
happens
happiness
happy
hard
hardcore
harder
hardly
hardy
harlem
harm
harry
has
hash
hast
hat
hatched
hate
hater
haters
hates
hatin'
hats
haunted
have
haven't
havin'
having
hawk
hay
haystack
hazard
hazel
he
he'd
he's
head
head's
headed
headin'
headlights
headlock
heads
health
healthier
healthy
hear
heard
hearin'
hearse
heart
heart's
heartbeat
hearted
heartfelt
hearts
heat
heaven
heaven's
heavy
heavyd
heck
hee
heed
heel
heels
hefty
heh
heights
heinz
hell
hell's
hella
hellafied
hello
helluva
help
helped
helps
hemmed
hemp
hennessey
hennessy
her
here
here's
heroes
heroin
hers
herself
hey
hi
hickies
hid
hidden
hide
high
higher
highness
highs
highway
hill
hillary
him
hind
hindsight
hinges
hint
hip
hippa
hippie
hips
hired
his
history
hit
hits
hitta
hittin'
ho
ho's
hoe
hoes
hoin'
hold
holdin'
holding
hole
holed
holiday
holla
holler
hollerin'
hollis
holly
hollywood
holsters
holy
homage
home
homeboy
homeboys
homegirls
homeless
homes
homework
homey
homicide
homicide's
homie
homies
hon
honda
honest
honey
honeys
honies
honked
honkin'
honor
honored
honour
hoo
hoochies
hood
hoodies
hook
hooked
hooker
hookers
hooks
hooligans
hoop
hootie
hootin'
hop
hope
hoped
hopefully
hopin'
hoppa
hopped
hops
horn
horny
horribly
horse
horseback
hos
hospital
hot
hotel
hotels
hotness
hots
hotter
hottie
hotties
hour
hourly
hours
house
housin'
houston
hov
how
how'd
however
huddle
hudson
huffin'
hug
hugable
huge
hugged
huh
huhha
hula
human
humble
hump
humpin'
hunch
hundred
hundreds
hung
hunger
hungry
hunk
huntin'
hur
hurry
hurt
hustle
hustler
hustlers
hutch
hydraulics
hype
hyped
hypnotic
hypnotize
hypocrite
hysteria
hyundai
i
i'd
i'll
i'm
i'ma
i'mma
i's
i've
ic
ice
iced
iceman
icon
iddy
idea
idiots
idol
idolize
idols
ies
if
ig'nant
ignorar
ignore
ignores
ignorin'
ill
illest
illie
illin'
illusion
im
imagination
imagine
imagined
immaculate
immaculately
immediately
imp
impartial
important
impounded
impress
impressed
impression
improve
in
in'
inception
inch
inclination
inclined
index
indo
ine
inevitably
infected
inferno
infidelity
infinite
inflated
influenced
info
infrared
initial
injection
injections
ink
inn
insane
insanity
inside
instead
instinct
insured
intentions
interchangin'
intercourse
interests
interior
internal
international
internationally
intervene
intervenin'
interventionist
interview
interviews
into
intoxication
introduce
intuition
invent
inventions
inventor
investa
invisible
invite
invited
involved
involves
iris
ironic
irrelevant
is
isiah
isle
isn't
isotoners
israelian
issue
it
it'd
it's
its
itself
itty
j
ja
jack
jacked
jacket
jackin'
jackson
jackson's
jacuzzi
jags
jail
jalil
jam
james
jammed
jammin'
jams
january
japan
jaw
jaws
jay
jazz
jealous
jealousy
jeans
jed
jeep
jeeps
jeezy
jefe
jeff
jefferson
jelly
jennifer
jergens
jerk
jerkin'
jerp
jerry
jersey
jesse
jesus
jet
jewelry
jewels
jezebel
jiffy
jig
jigga
jiggle
jigglin'
jiggy
jigsaw
jim
jimmy
jive
jivin'
jo
job
jobs
jock
jockin'
joe
john
johnny
join
joint
joints
joke
jokes
jokin'
jones
jordan
jordans
journey
journeyed
joy
js
juan
judge
juice
juicy
jump
jumped
jumpin'
jungle
junior
junk
just
justifies
k
kan
kane
kangol
kaopectate
karate
karats
kareem
karma
karrine
kate
kato
kay
keana
kee
keen
keep
keeping
keepkeep
keeps
keith
kemosabi
kent
kentucky
kept
ket
kettle
kevin
key
keys
khaki
khalifa
kick
kicked
kickin'
kicking
kicks
kid
kiddin'
kidding
kidnap
kids
kill
killa
killed
killer
killers
killin'
kim
kind
kinda
kindergarten
kindness
kinds
king
kings
kinte
kirkland
kiss
kissed
kissin'
kissing
kitchen
kitty
kizz
klingons
klondike
knack
knee
kneelin'
knees
knees'll
knew
knick
knicks
knife
knit
knives
knizz
knock
knocked
knockin'
knockkneed
knocks
knot
know
knowin'
knowledge
known
knows
knucklehead
kong's
kooky
kool
koreans
kotter
kreuger
kris
kross
kunta
kurtis
l
l's
la
lab
label
labelled
labor
lace
laced
ladder
ladies
ladies'
lady
lago
laid
lakers
lambo
lamborghini
lame
lance
land
landlord
lands
lane
lanes
lap
larceny
large
larger
larry
las
lasso
last
lasted
lastin'
late
lately
lateness
later
laters
latin
latino
laugh
laughed
laughin'
laughing
laughs
lauryn
lavishly
law
lawn
lawry's
laws
lawston
lawsuit
lawyer
lawyers
lay
layin'
lazy
le
leach
lead
leader
leadin'
leaf
leak
leakin'
lean
leanin'
learn
learned
learnin'
lease
least
leather
leathers
leave
leaves
leavin'
leaving
lebron
lecka
lecture
led
lee
lees
left
left,
lefty
leg
legal
legend
legendary
legit
legs
lem
lemme
lemonade
lend
leo
leprechauns
less
lessons
let
let's
lets
letter
letters
level
lewis
lex
lexus
lexuses
liable
liar
liberace
liberty
libido
libra
library
license
lick
licked
lickin'
licks
licorice
lie
lied
lies
liestyle
lieutenant
lieve
life
lifetime
lift
liftin'
light
lighter
lightnin'
lights
like
liked
likely
likes
likewise
lil
lil'
lime
limelight
limit
limits
limo
limo's
limousine
limp
limpin'
lincoln
lindsay
line
lined
linen
linens
lines
lingers
linin'
lip
lips
liquor
lisa
lisa's
list
listen
listeners
listenin'
listens
lit
little
live
lived
lives
livin'
living
llama
lo
loaded
lobby
loc
loc'ed
local
loced
lock
locked
locker
lockers
locks
loco
locs
lodi
logo
lohan
lois
loiterin'
london
lonely
long
longer
look
looked
lookers
lookin'
looking
looks
loop
loose
loot
lopez
lord
lorenzos
lorne
lose
lose,
loser
losin'
losin''
losings
loss
lost
lot
lot's
lots
lotta
lottery
lou
loud
louder
louganis
louie
louis
loungin'
love
love's
loveable
lovebug
loved
loveless
lover
lovers
loves
lovie
lovin'
low
lower
lowry
lows
loyal
loyalty
luck
lucky
luda
ludacris
luger
luger's
lumberjack
lunatic
lunatics
lunch
luncheon
lunches
lunchin'
lurkin'
luscious
lust
luther
luxury
lx
lye
lyin'
lynchin'
lypo
lyr
lyrical
lyrically
lyrics
m
ma
maam
mac
macaroni's
mace
machine
machines
machinin'
mack
mackin'
macs
mad
mad,
madder
made
madness
maestro
mafia
mag
magazine
magazines
magic
magician
maharaji's
mai
mail
main
maintenance
maize
major
majorly
make
maker
makes
makeup
makin'
making
male
mali
mall
malls
malnourished
malone
mama
mama's
mami
mamma
mammals
man
man's
man,
manhandling
manly
mansion
many
mar
marathon
mardi
margiela
marilyn
mario
mark
marky
marl
marley
marriage
married
marry
marshall
mart
martin
martini
marvin
mary
mase
maserati
mash
mask
mason
mass
massa
master
masterpiece
masturbates
match
matchin'
materialistic
mathematician
matter
matter,
maximum
maxin'
may
maybe
mayhem
mayonnaise
maze
mc
mc's
mcdonald's
mcs
mdma
me
mean
meaner
meanest
meanin'
meaning
means
meant
meastro
measure
meat
mecca
medallion
media
medical
medicine
medina
meditated
meet
meetin'
meets
mekhi
mellow
melody
melon
melt
melted
meltin'
member
memories
memory
men
menage
menstrul
mental
menu
mercedes
mercy
mess
message
messenger
messin'
met
metal
method
meurice
mexican
meː
mia
miami
mic
mice
michael
michelob
mickey
microphone
microwave
mics
mid
middle
middlin'
midget
midgets
midwest
mies
miggida
might
mighty
migida
mignon
migraine
mike
mil
mile
miles
miley
military
milks
mill
million
millionaire
millions
milton
mind
mind's
mindin'
minds
mine
miner
mines
minimum
mink
minks
minute
minutes
miracles
mirror
mis
misery
mishappens
miss
missed
misses
missin'
mission
mississippi
mistake
mister
misunderstood
misuse
mitsubishi
mix
mixalot
mixalot's
mixed
mizzac
mmm
mo
mo'
moan
mob
mobbin'
mobile
moccasin
moccasins
mocked
mode
model
models
moderate
moe
moet
moi
mold
molly
mom
mom's
moment
moments
momma
momma's
mommy
moms
monday
mondays
money
money's
monk
monkey
monotony
monotony's
monster
months
mood
moon
moonlight
moose
mop
moppin'
morally
more
mornin'
morning
morphine
mortem
mortician
moschino
moses
moss
most
mostly
motel
motell
mothafuck
mothafucker
mothafuckers
mothafuckin'
mother
mother's
motherfucker
motherfuckers
motherfuckin'
motivation
motor
motorola
motto
mount
mountain
mouse
mouth
mouth,
movado
move
moved
movement
mover
moves
movie
movie's
movin'
mower
ms
mtv
mu'fuckers
much
muffler's
mug
muggin'
mugs
muh
muh'er
muh'fucker
muhammad
multiply
mumble
munchin'
murder
murdered
mus
muscle
mushed
music
muslim
must
mustache
mutch
mutual
muzzle
my
myself
mystikal
myth
n
n'
n'sync
na
nada
naggin'
nah
nail
nails
naked
nam
name
named
names
narrative
nasty
nate
nathan
nation
natural
naturally
nauseous
navajos
navidad
nazareth
nd
near
nearly
neat
necessary
neck
necklace
necklaces
necks
need
needed
needle
needs
needy
negative
neglected
neighborhood
neither
nelly
neptune
nervous
nervous,
ness
net
nets
neva
never
nevermind
new
news
newsmen
newsweek
next
nic
nice
nicely
nick
nickname
nicknamed
nicole
nicole's
nien
nig
nigerian
nigga
nigga's
niggas
niggaz
niggaz'll
nigger
niggers
night
nightmare
nights
nik
nike's
nile
nin'
nina
ninas
nine
nineteen
nineties
ninety
nintendo
ninth
nip
nish
nissan
nite
nitro
nitty
no
nobody
nobody'll
nobody's
noise
noises
none
nonsense
nope
nor
norm
normal
north
northwest
nose
nostalgia
nosy
not
notch
note
notes
nothin'
nothing
notice
notorio
notorious
nough
now
now's
nowadays
nowhere
nuff
number
numbers
nurse
nurse's
nurses
nursin'
nut
nuthin'
nuts
nuttin'
ny
nyc
nympho
o
o'clock
o's
oak
oakland
oaktown
obie
observe
occupation
occured
ocd's
ocean
odds
of
off
offend
offense
offer
offered
office
officer
often
oh
ohh
oil
ok
okay
ol
ol'
old
older
ollie
olympic
omaha
on
once
one
ones
onion
only
onto
ooh
oop
op
open
opened
openings
opens
opera
opponent
opportunistic
opportunity
opposite
opthomology
optimo's
option
or
orange
order
ordered
ordinary
original
originality
orlando
orthopedic
orville
oshkosh
other
other's
others
otherwise
ouch
ought
ounce
our
ours
ourselves
out
outer
outkast
outlast
outlaw
outn
outrageous
outside
outskirts
outstanding
outta
outty
ov
oven
over
overload
overlook
overseas
overworked
owe
own
owned
owner
oxen
p
pa
pac
pace
paces
pacin'
pack
package
packed
packin'
packs
pacman
pad
padded
paddle
pads
page
pages
pagin'
paid
pain
pains
paint
paintin'
pair
palaces
pale
palin
palm
palms
pam
pane
panties
pants
pantyhose
papa
paparazzi
paper
papers
parade
paradox
paralysis
paralyzed
paranoid
parents
parents'
paris
park
parked
parkin'
parlay
part
parties
partner
parts
party
party's
pass
passed
passin'
passion
passionate
passport
past
pastel
pastor
pastry's
pat
path
pathology
patience
patterns
patty
paul
paused
paved
pavement
paw
pawn
pay
payback
paycheck
payin'
paying
payment
payne
pays
peace
peacefully
peach
peanut
peanuts
pear
pearl
pearls
peas
pecan
pedals
pedicure
pee
peel
peelin'
peels
peep
peepin'
peeps
peers
pen
pencil
penetration
penis
penny
pension
people
people's
peoples
pepa
per
percent
percocet
percolate
perfect
perfected
perfection
perform
perhaps
perignon
peripheral
perpetrate
perpetrating
perrierin'
perry
persian
persist
persistence
person
personal
perspective
persuasion
pete
peter
petite
phantom
pharrell
phase
phd
pheonix
phifer
phil
philadelphia
philant
philly
phone
phony
photo
phrase
phys
physical
pick
picked
pickin'
picky
picture
pictures
pie
piece
piece,
pieces
pied
pigeon
pigeons
piggy
pigment
pile
pill
pillow
pimp
pimpin'
pimps
pin
pinch
pinchers
pinchin'
pink
pinkie
pinky
pints
pip
pipe
piper
pipes
piss
pissed
pissy
pistol
pit
pitchin'
pitiful
pity
piz
pizzle
place
places
placin'
plaid
plain
plan
plane
planes
planet
planned
plans
plant
planted
plantiff
plastic
plate
plateau
plates
platinum
play
playa
playboy
played
player
players
playin'
playing
plays
plead
please
pleaser
pleasure
plenty
pliers
plight
plot
plug
plum
plus
po
pocket
pockets
poe
poet
poindexter
point
pointers
pointin'
points
poise
poison
pokin'
pole
police
polished
polite
politician
politicians
politicin'
politics
polo
pompeii
ponder
poo
pool
poom
poor
pop
popcorn
poppa
popped
poppin'
popping
poppy
pops
pores
porno
porsche
pose
position
positions
positive
posse
posse's
possess
possessive
post
posted
poster
pot
potato
pound
pounds
pour
pourin'
pouring
poutin'
poverty
pow
power
pox
ppin'
practice
prada
prairie
praises
prankster
pray
prayed
prayer
prayers
prayin'
preachers
precious
predicament
prefer
preference
pregnant
premiere
prenup
presence
present
president
presidents
press
pressed
pressure
presto
pretend
pretenders
pretending
pretty
price
priceless
prick
pride
primadonna
prime
prince
prince's
princess
principal's
prints
prior
prioritizin'
prison
prisoners
prissy
private
pro
pro'bly
pro'lly
probably
problem
problems
proceed
proceeded
produce
producer
product
profanity
profess
profession
profile
profit
project
projects
promise
promised
promises
promotin'
pronto
proper
proportion
props
prostitute
protect
protected
protection
protege
proud
proudly
prove
provide
provoke
psych
psychic
psycho
psychopath
psychotic
pub
puberty
public
pubs
puddle
puerto
puff
pull
pulled
pullin'
pulp
pulses
pum
pump
pumped
pumpin'
pumps
punch
punchin'
punishment
punk
punks
puppy
pure
purple
purples
pursue
push
pushing
puss
pussies
pussing
pussy
put
puts
puttin'
puzzle
q
quake
quarter
quarterback
queen
queens
ques
question
questions
quick
quicker
quickest
quickie
quicksand
quiet
quit
quite
quittin'
r
rabbit
race
racin'
rack
radio
rag
rage
rages
raggedy
raiders
rain
rainier
rainy
raise
raised
raisin'
raising
rally
ralph
ramada
rampage
ran
randb
rang
range
ranger
ranked
rap
rap's
rape
rapid
rapophile
rapper
rappers
rappin'
rapping
raps
rapture
rare
raspy
rasslin'
rate
rated
rather
rattlin'
raw
ray
rays
re
reach
reached
react
reaction
read
ready
real
realer
reality
realize
realizin'
realla
really
realness
reals
rear
rearrange
reason
reasons
receive
received
receiver
recently
recenyly
receptions
reckless
recognize
record
records
records'
recruiting
red
redding
redenbacher
reds
reed
reelin'
reese's
refaeli
referee
refreshments
refund
refuse
reggie
regret
regular
regulate
reign
reigns
rejoice
relapse
related
relates
relation
relationship
relax
relaxin'
relaying
release
relevant
relief
relieve
remain
remains
remember
remi's
remincise
remind
reminice
reminisce
remorse
remy
renaissance
rendezvous
rent
rental
rented
reotation
rep
repercussions
replace
reply
reporter
reporters
represent
request
rerunnin'
resist
respect
respond
responses
responsibilities
rest
restraint
results
resuscitates
retarded
retire
retrieve
return
returned
reunion
reveive
revelation
revenge
reverse
reversible
reviled
revolution
rewinds
rhapsody
rhyme
rhymes
rhymin'
rhythm
rhythmic
ri
rib
ribbon
rican
rice
rich
richer
riches
richie
richmond
rick
rid
ride
rider
riders
rides
ridin'
riff
riffin'
right
right,
rims
ring
ringin'
rings
riot
rip
rippin'
rise
risin'
risk
river
ro
roach
road
roads
roam
roasta
rob
robato
robbed
robbery
robbin'
robbing
robin
robots
rock
rock'n'roll
rock's
rocka
rocked
rockin'
rocking
rocks
rode
rodeo
rodham
rodman
rodney
role
rolex
roleys
roll
rolled
roller
rollers
rollies
rollin'
rolls
romance
romancin'
rome
ron
roof
room
roomy
rope
ropes
roscoe's
rose
rosecranz
ross
rotten
rottin'
rough
roughest
round
rounds
route
routine
rov
row
row's
roxanne
royal
rub
rubber
rubbers
rubbin'
ruby
rucker
ruckers
rude
rug
rugs
ruin
rule
ruled
ruler
rules
rulin'
rum
rumble
rump
rumpelstiltskin
rumper
rumps
run
runaway
runneth
runnin'
running
runs
runway
rush
rushed
rushes
rushin'
russell
ry
s
s's
sac
sack
sactown
sad
sadaharu
sadder
saddle
sadie
sadistic
safe
sag
saggin'
said
said,
sake
sakin'
salad
salary
salem's
sales
salon
salt
salty
salugi
same
sampras
sampson
san
sand
sang
sangin'
sanitation
sarah
sardines
sassoon
sassoons
sat
satan
satellite
satin
satisfaction
satisfy
saturday
sauce
sauna
save
saved
savin'
saw
saws
say
say,
sayin'
saying
says
scale
scales
scandal
scantily
scar
scared
scarin'
scars
scary
scatters
scene
scheme
schemin'
schmoe
school
schooled
schoolin'
science
scientist
scissors
scold
scooby
scoop
scorchin'
score
scored
scrap
scratch
scratchin'
scream
screamed
screamin'
screams
screen
screw
screwed
screwin'
screws
scrilla
scrr
scurred
se
sea
seacrest
seagram's
sean
search
searchin'
seasoned
seat
seatbelt
seater
seats
seattle
second
secondary
seconds
secret
secretary
sect
section
sections
security
sedan
seduction
seductive
see
seed
seeds
seein'
seem
seemed
seems
seen
sees
sega
seize
seldom
select
selection
sell
sellin'
sells
semi
send
sends
seniors
sensation
sense
sensed
senses
sent
sentences
separate
seperately
seperates
serena
serenade
series
serious
serve
servin'
serving
sess
set
sets
settle
sev
seven
seventeen
seville
sewin'
sewn
sex
sexes
sexin'
sexual
sexy
sha
shack
shade
shaded
shades
shadow
shadows
shady
shaiyeeda
shake
shaker
shaker's
shakes
shakin'
shall
shame
shank
share
shared
sharing
sharp
shave
shawty
shazam
she
she'd
she'll
she's
shed
sheep
sheer
sheet
sheets
shelf
shell
shells
sherry
shindig
shine
shines
shingle
shinin'
shiny
ship
ships
shirt
shirts
shit
shits
shittin'
shizzle
sho
sho'
shock
shocked
shoelaces
shoes
shoobie
shook
shoot
shooter
shootin'
shoots
shop
shoppin'
shopping
shops
shore
short
shorties
shortstop
shorty
shot
shotgun
shots
shotty
should
should've
shoulda
shoulder
shoulders
shouldn't
shout
shouted
shoved
shovel
show
showed
shower
showers
showin'
shows
shrink
shuffle
shut
shuttin'
shuttle
shy
si
sicilion
sick
sicka
sicker
sid
side
sidekick
sidelines
sidewalk
sight
sign
signals
signed
signin'
signs
silent
silicone
silk
silly
silver
sim
similar
simmons
simple
simply
simps
sin
sinatra
since
sincere
sincerity
sing
singer
singers
singin'
single
sinister
sink
sinkin'
sinner
sinners
sins
sip
sippin'
sir
sire
sirens
sis
sista
sistas
sister
sit
sits
sittin'
sitting
situation
six
sixteen
sixteens
sixty
sixtytwo
size
sizzle
skate
skateboard
skated
skatin'
skeeza
skiddle
skill
skills
skin
skinny
skins
skip
skirts
skunk
sky
sky's
skypager
slack
slacks
slain
slam
slang
slap
slapped
slappin'
slaps
slayin'
sleazy
sleep
sleepin'
sleeps
sleepwalkin'
sleepy
sleeves
slick
slicker
slickest
slide
slidin'
slightest
slightly
slim
slip
slipped
slippin'
slop
slow
slowly
slug
sluggo
slum
slutted
smack
smacked
small
smalls
smart
smarty
smash
smell
smellin'
smells
smelt
smile
smiled
smiles
smilin'
smiling
smith
smocks
smoke
smoked
smokes
smokin'
smoking
smooth
snacks
snail
snakes
snap
snapped
snappin'
snatch
sneak
sneakers
sneakin'
sneaks
snitchin'
snoop
snow
snub
snuka
so
so'ma
soap
sober
social
society
sock
socks
sofa
soft
softly
soggy
soil
sold
soldier
soldiers
solely
solemnly
solution
solve
some
somebody
somebody's
somehow
someone
someone's
somethin'
somethin's
something
sometimes
somewhat
somewhere
son
song
songs
sons
soon
soothes
sophisticated
sophisticater
sophomore
sorry
sort
sorta
soul
soul's
souls
sound
sounded
sounds
soup
sour
source
south
spa
space
spaghetti
spanish
spank
spark
sparkin'
spawn
speak
speakerboxxx
speakin'
spears
special
specialize
specially
spectatin'
speech
speed
speedin'
speedy
spell
spend
spent
sperm
speshly
spewin'
spike
spiked
spill
spilled
spillin'
spilling
spin
spine
spinners
spinning
spirit
spirits
spit
spittin'
splashin'
spliffs
splinta
split
splits
splurge
splurgin'
spock
spoiled
spoke
spokes
sport
sportin'
sports
spot
spots
spray
sprayed
spread
spree
sprees
spring
sprung
squad
squander
square
squares
squash
squaws
squeakin'
squeal
squeeze
squeezin'
squirrel
squirt
squish
sta
stack
stacked
stackin'
stacks
stacy
stage
stages
stagnant
stairs
stake
stakes
stale
stalkin'
stall
stallion
stamps
stance
stand
standin'
standing
stands
stank
star
stare
starin'
staring
starry
stars
starsky
start
started
startin'
starting
starts
stash
state
statement
states
static
stations
statue
stay
stayed
stayin'
stead
steadily
steady
steak
steal
stealin'
steam
steamin'
steel
steez
stefani
step
stepdad
stephanie
stepped
steppin'
stepping
steps
stereo
stereotypes
steve
stick
stickin'
sticking
sticks
sticky
still
stimulate
sting
stingers
stingy
stink
stinkin'
stinks
stinky
stir
stitches
sto'
stock
stole
stolen
stomach
stomp
stompin'
stomping
stone
stood
stool
stoop
stop
stopp'in
stopped
stopper
stoppin'
stops
store
stores
stories
story
straddle
straight
straightjacket
strain
strange
strangers
strap
strapped
straw
strawberries
strawberry
straws
stray
street
streets
streets,
strength
strengthen
stress
stressed
stressin'
stressy
stretch
strict
strictly
stride
strike
string
strings
strip
stripe
stripes
stripping
strivin'
strobe
stroke
strolled
strollin'
strong
stronger
struck
struggle
struggles
strugglin'
stu
stuck
studded
studio
studs
study
stuff
stuffed
stumbled
stump
stun
stung
stuntin'
stupendous
stupid
stutter
stuy
style
style's
style,
stylish
sub
subliminally
subscribe
subtle
success
successful
sucession
such
suck
sucka
sucka's
suckas
sucked
sucker
suckers
suckin'
sucking
sucks
sudden
sue
suffer
suffocate
sugar
sugarcoat
sugarhill
suicidal
suicide
suicides
suin'
suit
suitcase
suits
summer
summer's
summers
summertime
sun
sunbeam
sunday
sundown
sunk
sunrise
sunroof
sunroofed
sunshine
super
superbowl
superior
superman
supersonic
superstar
superstardom's
support
support's
suppose
supposed
supreme
sure
surely
sureshot
surface
surgery
surprise
surprised
survival
survive
survived
suspension's
swag
swagger
swallow
swass
swear
sweat
sweat's
sweater
sweatin'
sweaty
sweep
sweet
sweeter
swell
swerve
swift
swiftly
swim
swimmin'
swing
swinger
swingin'
swiss
switch
switched
switches
switchin'
swoll
swoop
swoopin'
sword
swore
symbol
symbolize
symbolizes
syringe
system
system's
t
t'ree
t'ward
ta
table
tablet
tac
taco
tad
tag
tai's
tail
take
taken
taker
takes
takin'
taking
tale
talk
talked
talkin
talkin'
talking
tall
tallest
tamin'
tammy
tampa
tan
tang
tank
tanqueray
tap
tape
tapes
tappin'
taste
tastes
tatted
tattoos
taught
taxes
taya
taylor
tbone
tea
teach
teacher
teachers
teachin'
team
tear
tearin'
tears
tease
tech
teddy
tee
teenage
teenager
teens
teeter
teeth
tel
telephone
television
tell
tellin'
telling
telly
temper's
temperature
temperature's
tempo
temporrary
tempt
temptation
ten
tender
tension
tent
ter
tercel
term
terrible
territory
terror's
terrorize
test
texas
text
texus
thailand
than
thang
thank
thankful
thankin'
thanks
that
that'll
that's
that,
thats
thaw
the
theater
thee
their
them
theme
themes
then
theory
there
there'll
there's
therefore
these
they
they'd
they'll
they're
thick
thief
thievin'
thigh
thighs
thing
things
think
thinkin'
thinking
thinks
thinner
thinnest
third
thirstay
thirty
thirtythree
this
this'll
thiz
tho'
thong
thongs
those
thou
though
thought
thoughts
thousand
thrashin'
three
threeone
threes's
threethousand
threw
thrill
thriller
thrived
throat
throb
throne
through
throw
throwed
throwin'
throws
thug
thugged
thuggin'
thugs
thumb
thump
thumped
thumpin'
thursday's
tick
ticket
tickets
ticklin'
tie
tied
ties
tigers
tight
tigre
til
til'
till
tilt
timber
timbs
time
time's
timeless
times
timid
tims
tin
tingles
tint
tinted
tints
tiny
tion
tip
tipped
tippin'
tips
tipsy
tire
tired
tires
title
titles
tits
tizza
tlc
to
toast
toastin'
toby
tock
today
toe
toein'
toes
together
tois
toke
told
told,
tom
tommy
tomorrow
tomorrow's
ton
tone
tongue
tonguin'
tonight
tons
tony
too
took
tool
tools
tooth
toots
top
tornado
torture
toss
total
tote
totem
totter
touch
touchdown
touched
tough
tougher
toughest
tour
toured
tours
toward
towards
towel
town
town's
toy
toyo
toys
track
tracks
trade
traded
trades
traditional
traffic
tragedy
tragic
trail
trailer's
train
trained
trance
transformed
translation
transportation
trap
trapped
trappin'
trash
travel
travelin'
travelled
tray
treacherous
treasure
treat
treated
treatin'
treatment
treats
treble
tree
trekkies
tremendous
trend
tri
tribe
trick
trickin'
tricks
tried
tries
trigger
trim
trina
trinity
trio
trip
triple
trippin'
triz
trot
trouble
trousers
truck
trucks
true
truer
truly
trunk
trust
truth
try
try'na
tryin'
trying
tryna
tryst
ts
tta
tub
tube
tucker
tuh
tummy
tune
tunechi
tunes
tunnel
tupac
turbo
turn
turned
turnin'
turns
turntable
tuxedo
tv
tv's
tvs
tward
tweak
tweakin'
twelfth
twelve
twenty
twentyfive
twentyfour
twerk
twerkin'
twice
twilight
twinkie
twist
twisted
two
twoonethree's
twos
ty
tyco
type
types
typical
tyson
u
ugh
ugly
uh
uhh
uhuh
ultimate
um
umbrella
unamerican
unchanged
under
underarm
underground
underpaid
underroos
understand
understandin'
understood
undertaker
undoubtedly
undressed
undry
undyin'
unfadeable
unfolds
unforgettable
unfurl
unfurnished
ungrateful
unhappy
unheard
uni
union
unique
unit
unites
unity
universe
university
unless
unnecessary
uno
unparalleled
unreal
unseen
unsoiled
unstoppable
until
untouchable
up
upbeat
upon
upper
ups
upset
upside
uptown
uranus
us
us'll
us,
use
used
usher
usin'
usually
utmost
uzi
v
vacation
vacay
valiums
valley
values
vamanos
van
vanaderin
vanilla
vans
vd
vegas
venereal
venice
venom
venture
versace
versatile
verse
very
vest
vet
vexed
viagra
vibe
vibes
vibrate
vibration
vibrations
vicious
viciously
video
videos
view
views
villa
villain
ville
vincent
vintage
vinyl
violate
violence
violent
vip
virgin
virginia
vise
vision
visions
visit
visual
vo
vodka
vogue
voice
void
volcano
voli
volume
voluntary
vomit
voters
vowed
vowels
vu
vuitton
vulture
wack
wade
wafers
wage
waist
waistside
wait
waitin'
waiting
waitress
wake
walk
walked
walkin'
walking
walks
wall
wallet
walls
wan
wanderin'
wanders
wanna
want
wanted
wantin'
wanting
wants
war
warden
wardrobe
warm
warmth
warn
warned
warnin'
warren
warren's
was
wash
washed
washin'
washington
wasn't
waste
wasted
wastin'
watch
watchin'
water
waterbed
wave
waves
wawin'
wax
way
wayans
wayne
ways
wazup
we
we'd
we'll
we're
weak
weakenin'
wealth
wealthy
weapons
wear
wearier
wearin'
wearing
weary
weather
weaves
weavin'
wedding
wednesdays
wee
weed
week
week's
weekend
weekends
weeks
weez
weezy
weighed
weighin'
weighs
weight
weird
weirder
welcher's
welcome
welfare
well
went
were
weren't
wessun
west
westside
westside—
wet
whassup
what
what's
whatcha
whatever
whattup
wheel
wheelin'
wheels
wheezy
when
whenever
where
whereever
whether
which
whichever
while
whilin'
whim
whine
whip
whiplash
whipped
whippin'
whips
whisperin'
whispering
white
whiter
whiz
who
who'da
who's
whoa
whoever
whole
whoo
whoomp
whoop
whoopin'
whopper
whoppin'
whore
whores
whose
why
wi
wi'
wi'tcha
wich
wife
wigger
wiggida
wiggle
wild
wildcat
wilkins
will
williams
willie
willin'
willis
willy
wilson
wilt
wimp
win
wind
windmill
window
windows
windpipe
wine
wines
wings
wink
winked
winking
winks
winner
winners
winnin'
winning
winter
wintour
wipe
wipin'
wise
wisely
wish
wishin'
wit
wit'
wit'cha
witch
with
within
without
witness
witty
wiz
woah
wok
woke
woman
woman's
women
won
won't
wonder
wont
woo
wood
woof
woofer
woogie
woolery
woozy
wop
wor
word
wordplay
words
wore
work
worked
workin'
workout
works
world
world's
worldwide
worm
worms
worn
worried
worries
worry
worse
worst
worth
worthless
worthwhile
would
would've
woulda
wouldn't
wound
wow
wrap
wreck
wrecka
wrecked
wrecker
wreckin'
wreckless
wrecks
wringer
wrist
write
writin'
writings
wrong
wrote
wu
x
xzibit
y
y'all
ya
ya'll
yacht
yah
yall
yankee
yard
yay
ye
yea
yeah
yeah,
year
yearned
yearnin'
years
yell
yelled
yellin'
yelling
yellow
yellows
yells
yen
yep
yes
yessuh
yesterday
yet
yikes
yo
yo'
yodel
yonder
york
you
you'd
you'll
you're
you's
you'se
you've
you,
youd
young
your
yours
yourself
youse
youth
yummy
yup
z
zack
zags
zat
zealous
zero
zig
zip
zipper
zips
zone
zones
zoom
zootie
zs
|i
~haq