{
    "punk": "\"A guy walks up to me and asks 'What's Punk?'. So I kick over a [garbage can] and say 'That's punk!'. So he kicks over [the garbage] can and says 'That's Punk?', and I say 'No that's [trendy]!",
    "wiggy": "A [contemporary] nickname for the wig-wearing \"[King of All Media]\" [Howard Stern].",
    "doo": "A word meaning \"dude\" that [white rich] kids say to sound cool. Usually found in [the suburbs] of the richest part of town. 1/2 of whom try to [act black] or think they are the shit. ",
    "silkk": "[Best rapper ever] to be born in [New Orleans]. Youngest brother of [Master P].",
    "diggy": "a friend, [pal], or other accquaintance.  Usually used when the [said person] is getting [overly excited] or angry.",
    "loot": "[money]",
    "gat": "Old slang, meanging gun. Came from shortening Gattling gun to just gat. Was used during the [prohibition] era to name any gun, but specifically the thompson [submachine gun], aka The [Tommy Gun].",
    "wack": "1) Lame, [sorry ass], aint even [legit]\r\n\r\n2) To [Jerk off]",
    "jack": "Jack -\r\nA very intellectual, insightful man with the most honest heart. His intentions and words are always well intended and he has the sexiest eyes in the whole world.\r\nIf you ever argue with a 'Jack' he will for sure make a Jack Ass out of YOU.\r\nHe always thinks ahead and see's [the bigger picture]. He hates fighting/ [argueing]. * yawn* its boring to him.\r\nBut he will always win because he plays by his own rules. His morality is strong and hes as dependable as a solid rock. A guy you can count on. Loves meeting new people where ever he goes. Loves freedom. Hates being conformed. Wont change for anyone and wont expect you to change either.\r\nHighly independant. Likes to use his head. And its a very powerful one..very brilliant. Has women falling every where while hes still standing.\r\n[Humbel].Funny. Wont lie.",
    "puba": "[Pope Puba], aka Pope Puba the Great, is one of several founding members of [Pope Law]. He is wise beyond his years, and if you watch him closely, you may catch a glimpse of his signature move...the [poob kick].",
    "gee": "[Dublin] [slang] for [female genitalia]",
    "diggie": "a friend, [pal], or other accquaintance.  Usually used when the [said person] is getting [overly excited] or angry.",
    "willie": "[Dope]; [off the chain]; tight [as fuck]; the shit.",
    "brew": "Can be used when referring to having a beer.\r\nAlso may be in reference to [smoking weed].\r\nAlso less urbanly used in [England] to describe [having a cup of tea].",
    "nubian": "A [gorgeous], sexy, [black woman] with an utterly [perfect figure].",
    "props": "[Proper] [recognition]",
    "bushwick": "A [neighborhood] in [Brooklyn's] [northside] that was once considered the worst neighborhood in America.",
    "buckin": "The beautiful and longlasting bromance between [Chris Martin] and Johnny [Buckland] of [Coldplay].",
    "posse": "your [crew], your [hommies], a group of friends, people who [may or may not have] your back",
    "diggi": "a friend, [pal], or other accquaintance.  Usually used when the [said person] is getting [overly excited] or angry.",
    "smebbin": "drivin [drunk], or [buzzed]",
    "peep": "to [look at]; to [listen] to",
    "pos": "1) [Piece Of Shit]\r\n2) [an abbreviation] some companies use for Positively [Outstanding] Service.",
    "koopsta": "A rapper who use to be with [Triple Six Mafia]. He usually had a satanic voice when he [rapped]. His best album was his first underground album Da [Devil's] Playgrond.  After he quit 3-6 he made two albums by himself, but they weren't as well written.",
    "ruff": "When you have sex [to the point] a [hoe] [crys]",
    "buckwild": "[insane], or [out of control]",
    "cream": "[Cash] [Rules] [Everything] Around Me",
    "ced": "Used as a replacement for Cuss/[Swear word's] on message board [forum's].  Ced(moderator) had the shortest name and so became the standard for self [censorship].",
    "redman": "one of the dopest rappers out there, has funky beats\r\n\r\nFrequently works with [Method Man] on music, film, and TV shows and ads.\r\n\r\nMember of Def Squad featuring [Keith Murray] and Erick Sermon\r\n\r\nHis first Album, \"Whut? Thee Album,\" is considered a hip-hop classic.\r\n\r\nIs signed to [Def Jam] Records.",
    "bucked": "[Shot]",
    "tricks": "tRicK'(n.) [A broad] term for describing women who are either teases, [hoes], or one of the above pretending to be the other. Calling a woman a trick shows you are [not impressed]/convinced by their shit.",
    "baf": "Acronym of [Bored as Fuck].\r\nCan also be used as [BAFF] - Bored as [Fucking Fuck].\r\nDescribes a state of extreme boredom.",
    "mack": "Mack- (verb) To hit on, flirt with, or [seduce] a female by using verbal or sometimes physical means of [persuasion].\r\n\r\nsee also: [Mack Daddy]",
    "scarecrow": "A sweet fuckin' Batman character from DC who gives people [nightmares]. He pales in comparions to the [Joker], but he's cool [none the less]. ",
    "hort": "The [seam] on your [scrotum] - the [testicular] seam.",
    "phife": "Phife Dawg was a member of the legendary rap group [A Tribe Called Quest] along with Q-Tip & Ali [Shaheed] [Muhammed].",
    "caps": "n. [bullets]",
    "yippie": "Term created by [Abbie Hoffman] and Jerry [Rubin] in the mid-1960s to refer to \"members\" of the Youth International Party ([YIP]!).  The YIP! was dedicated to merging [New Left] activism and the hippie counterculture to create a revolution that would be both personal and political--as well as fun.  Yippies tended to gather in large cities, particularly in [Manhattan's] Lower East Side, where Rubin and Hoffman both lived during the 1960s.  Yippies rejected all [-isms], including socialism and anarchism, in favor of the motto of \"Do your own thing\"--i.e., don't conform to a specific system of belief but rather be an individual.  At the same time, collective action was at the root of [Yippie] activism, and Yippies participated in \"be-ins\" (normally associated with hippies) and other collective gatherings.  And although the YIP! did not promote any one -ism (and, despite Hoffman and [Rubin's] involvement, was a self-proclaimed \"leaderless\" movement), the \"party\" was extremely leftist, advocating social justice for all and arguing that all property--including housing, clothing, and food--should be FREE.  The Yippies' most famous actions include the attack on the New York Stock Exchange (when Yippies threw money to the floor and watched as those below fought for it) and their involvement at the 1968 Democratic Convention in Chicago, at which they nominated a pig for president.  Much of the Yippies' activism consisted of guerrilla [street theater] and symbolic acts (such as that at the [NYSE]) to make a point; Yippies understood the power of the media and sought press to [disseminate] their revolutionary messages with a pointed disinterest in the accuracy of the stories told about them.  Since the term is rooted in a particular historical moment, calling anyone a \"Yippie\" today would probably be inaccurate.",
    "alamo": "The greatest battle in history, [189] Texan farmers defend a run down church against 5,000 Mexicans; 1,600 of whom are killed or wounded in the battle, although every single one of the defenders were killed it [brough] time for [Sam Houston] to form an army and beat the Mexicans at a later date.",
    "dank": "Also an expression requently used by [stoners] and [hippies] for something of [high quality].",
    "alkaholik": "1) A.K.A Alcholic (For all you people who like spelling korrektlee) A term used for someone who enjoys, or just does it for no reason, drinking [alchohol].\r\n2) [Number 6]. on Xzibits [restless] album.",
    "dig": "v.\r\n1. To perceive and comprehend the nature and significance of; grasp; gather. “[Ya dig]? Yeah [I can dig it]”\r\n\r\n2. To find attractive, pleasant, to enjoy.  “I [dig on] that Trim, man; girl is fine!”",
    "boof": "To [stick] something [up your butt], generally [drugs] but can include anything.",
    "fonky": "[nasty], dirty, [cheap], [gross], etc..\r\n",
    "pervin": "When a person makes [you lose] your [innocence] and you start to be [perverted].",
    "biddy": "In Australia a biddy is a two-for-one McDonald's [voucher]. It usually entitles the [bearer] to enjoy two delicious Big Macs for the price of one, but can apply to other items, such as fries and [cheeseburgers].",
    "flex": "As far as [urban slang], the definition is \"to show off.\"  Used by many rappers, most notable [Ice Cube] and the [Geto Boys].  Originated in the urban community, and has been used for quite some time.",
    "funkdafied": "Crazy, [Weird], [Funky] but [in a good way].",
    "pig": "a [officer] of [the law]\r\n\r\n[police]",
    "sess": "marijuana, weed, [pot], [herb], [ganja]",
    "shocker": "The act of inserting 2 fingers into the vaginal opening (normally the index and middle fingers), and 1 into the anus (normally the \"pinky\" finger).  This is usually performed when she is [laying back], in the \"[deep thrust]\" postion (see \"deep thrust\" for more hardcore info).  Commonly described a numerous number of ways, e. g.  2 in the pink, 1 in the stink;  two in the grass one in the ass;  two in the slut one in the butt;  two in the [koot], one in the boot;   goin to town with one in the brown; and many more, this method of sexual gratification is one sought out by people of all levels.  But only grand masters, like the Big Johnson have perfected it.",
    "knicca": "A rapper who use to be with [Triple Six Mafia]. He usually had a satanic voice when he [rapped]. His best album was his first underground album Da [Devil's] Playgrond.  After he quit 3-6 he made two albums by himself, but they weren't as well written.",
    "bozack": "The sack-like [structure] that holds [the balls]",
    "giggety": "1.Usually said when someone or yourself says a sexual joke.\r\n2.Usually said when someone or yourself is [sexually aroused].\r\n3.[The catch] phrase of a character named [Quagmire] on the hit T.V. show Family Guy.",
    "beyotch": "a more [formal] [greeting] than [bitch].",
    "shaheed": "The [truthful] [one] ",
    "defari": "[Faggit] who is [slave] but a member of [the kkk]",
    "gats": "Old slang, meanging gun. Came from shortening Gattling gun to just gat. Was used during the [prohibition] era to name any gun, but specifically the thompson [submachine gun], aka The [Tommy Gun].",
    "ruffneck": "A [thuggish], [rough] [street smart] type guy. Heard in New York a lot.",
    "pmd": "[Put Me D], the act of getting someone(typically [a friend]) to [introduce] you to a guy/girl for you so u can get their number n stuff.",
    "ruckus": "a disturbance, [loud] [obnoxious] [noise]",
    "milo": "The greatest [puppy dog] to live on this planet or any planet anywhere at any given time in any [plane] of existence or [alternate dimension].",
    "sadat": "[Sadat] is a [confident] man, but his feelings can be hurt easily.\n\nWith [chicken].",
    "guage": "The application of a [substantial] amount of lead to the [brain pan] of someone who has become [bothersome].  ",
    "mary": "A very beautiful girl both inside and out. She is very sweet and funny. She likes to tell stories with no point, and laughs for long periods of time at her own jokes. She has a [contagious smile] that can't help but spread to others. Her heart is filled with joy, and she very much enjoys doing things for other people. She can [be clever] and sarcastic and somewhat witty. She may not be the prettiest girl out there, but her joy and her compassionate heart makes her more beautiful than one can imagine. Her style is all her own. The love she has for her family is [irreplacable]. She is artistic and creative. She isn't like everyone else...and that's just the way Mary should be.",
    "bootsee": "- A sucka, a ignorant mothafucka\r\n- One of them show [boatin'] [high sidin'] want to get some attention type niggaz \r\n- That ol' nigga that got everybody in the town thinkin' he sittin' nice on at least 20's, but he ain't movin nothin but 10's\r\n- Dey b laughing and smiling, loving and hugging a brother grinning, then dey turn around and talk behind your back the next minute\r\n- Sum1 who aint [got game]",
    "diss": "a shortened [version] of \"[disrespect]\"",
    "steez": "[Plain] [old style] with eaaaaze\r\n",
    "capri": "[A sweet], loving, kind and beautiful individual. Generated from the beautiful [island] in [Italy]",
    "papes": "[Money], [cash]",
    "dug": "[Dug] [is the new] [duh] especially on iphones, where they correct all your words for you and especially if you're drunk.",
    "huddy": "Bitter huddys are ex-fans of the American TV series House who are unable to deal with the break-up of the so-called [huddy] couple (a portmanteau blending the character names House and [Cuddy]) and the subsequent decision of [Lisa Edelstein] (the actress who portrayed Cuddy) not to [renew] her contract and leave the series.\n\nBitter huddys tend to spend their time trolling House fansites to spoil everyone's fun, insult every fan who dares to enjoy the series without Cuddy, send hateful messages to the Twitter accounts of House crew and cast members, and generally display appalling behaviour that is increasingly painful to watch.\n\nMost of their hate is directed at the series star, [Hugh Laurie], and seems to be based either on the fact that he didn't release a public statement praising Lisa Edelstein until the begin of the new season, or (and the opinions seem to differ here) the fact that he didn't somehow prevent her leaving altogether. A third opinion seems to be that he should have abandoned the show when she did, in a contract-breaking display of solidarity.\n\nWhile some bitter huddys eventually turn away from the series and find something new to enjoy, a small but very [vocal group] remains online, picking fights with other fans, starting unfounded rumours about the circumstances surrounding [Lisa Edelstein's] exit, and trying to spread hate and bitterness wherever they go.",
    "kare": "An awesome girl who will always be there for you\r\nUsually [mexican]\r\nUsually really pretty and smart even though she acts dumb\n\nA little self [concious]\n\nNot a slut\n\nA great friend and funny and [hyperactive]",
    "locced": "a.) a term [crips] use to call eachother.\r\nb.) a [crip] term meaning crazy, wild or insane\r\nc.) the leader or OG of a [crip gang]",
    "trife": "1. livin at the \"[rock bottom]\" of life; just gettin by\r\n2. [thug like], [hustlin], selling, or \"holding\"",
    "danja": "any of the small [amphibious] life forms in the greater [boise] area who smoke a gang of weed and play the bass guitar. Often defined by the excess use of [angel dust].",
    "jigga": "1)orginated as \"[jiggaboo]\", an insult or racial slur applied to black people who were just a little [wilder] than the rest\r\n2)later on, like the 80's, only certain blacks, and maybe even other races, were reffered to as jigga(boos), usually pimps or others who had a [wild style]\r\n3)a person, place,thing that is jiggy, fly, fresh (when jiggaboo style came to be appreciated and hip-hop culture started to evolve)\r\n4) one who has nice jewelery or clothing... jayZ calls himself jigga for a reason!",
    "phat": "1. [cool]\r\n2. [Pretty Hot] And [Tempting]",
    "creepin": "-to [cheat]",
    "lye": "[marijuana], [pot], [ganja]",
    "oodles": "[a lot] (of [something]), [plenty] of something",
    "jacked": "1. Verb: Past tense\r\n\r\nOrigin from 'hijacked': as the past-progressive meaning stolen in a violent fashion.\r\nCommonly refers to [robbery], theft, misuse, [seizure], [possesion].\r\n\r\n 2. Adjective\r\n\r\nWell muscled, iron-bound, pumped.",
    "silk": "a girl you would love to know. absolutely funny, easy to hang around with, stunningly beautiful and always a bit naughty. they [smell good] and like looking at things with a [preference] for [glitter]. enjoy dancing cheesy moves.",
    "slammin": "1.  adj. Something which is [very good].\r\n2.  [vt].  to [inject] a drug intravenously",
    "jazzy": "Someone who is so [smooth] and [fly]. Real and [classy] all at the same time",
    "capone": "Reference to [Al Capone], famous Chicago gangster. If you're \"[straight up] capone\" you're a true gangsta out there on the streets, not one to [be fucked] with.",
    "fli": "Generally used to designate a poorly drawn smiley in [MSN messenger] that may or may not look like a fly. In reference to a [Jack Handey] Deep Thought that ended with \"That alien!\", but written in english shitty enough to make you [invert] singular and plural and put the letter D instead of the \"th\" sound.",
    "kurupt": "[a dogg] pound gangsta\r\ntha kingpin\r\nyoung [gotti]\r\ntha young gottstra, a young [frank sinatra]...",
    "steelo": "Slang for style; [a playa's] [aura].  Some get this definition confused with swagger. It can be your fashion but that's just part of [the bigger picture]. Let's just say, the devil didn't make you do it, it was your steelo. ",
    "skeezer": "1) A slang term for woman with low morals and poor [hygene]. Derived from 'Skeezy', a variant of the word 'Skeevy', meaning filthy or stained with fecal matter, urine and/or semen.\r\n2) A low-class prostitute; one who is [diseased], ugly, prematurely aged and/or worn-out from hard work and [rough trade].\r\n3) An immoral woman with no pride; one who engages in humiliating and degrading sexual acts for little or no gratitude or reward.",
    "beeotch": "[otherwise] [known] as [another word] for bitch",
    "pavle": "A male [Serbian] name; the Serbian iteration of Paul. Originated from \"[paulus]\", meaning \"[humble]\" in Latin.",
    "shammin": "Old [military slang] for the art of making it look like your working when your not.\r\nI.E Carrying a [clip] board around looking at it  [periodically] While walking around. \r\n",
    "soop": "To shoot a gap. Refers to the sound made when cutting it close. Often accompanies a huge [adrenaline rush]. Originates from track when [a runner] passes between 2 other [runners], and recently has made its way into common usage.",
    "slack": "For a [SubGenius], Slack can be anything you get or enjoy out of life that you don't have to work for or pay for , an approach where one stops trying to make things happen or exert control, and instead simply \"allows\" or \"lets\" favorable events to occur.  Everyone is born with Original Slack, an ideosyncratic harmony with the flow of life which the unwitting Conspiracy of [Normality] is unceasingly trying to trick us into giving up, often as a [Con-job] in exchange for False Slack (anything you're sold or conned into that you have to work for or pay for, or the obligation of working or paying for it).",
    "kaze": "the japaneese [word] for \"[wind]\"",
    "drex": "drunkology for [Drunken Sex].",
    "clout": "[Clout] is being [famous] and having [influence]",
    "thugstas": "[thug]+[gangsta]=thugsta",
    "jane": "short term name for marijuana...people who smoke pot often love [Jane's]\r\n\r\nthe name of the most beautiful woman in the world, other woman were so [jelous] of Jane's that they made up a term for Jane's calling them plain because it rhymed and made them feel better about themselves cause they were not names jane and they are ugly.\r\n\r\n[janes] are always the girls with the sense of humor in any group\r\n\r\n[jane's] can also be that girl that had a crush on you in high school but you never dated, then she shows up at the [reunion] lookin all hot and successfull, then you kick your self in the ass for not being nicer to her because now she is hot and wont give you the time of day.\r\n\r\njane's are better then everyone, and are usually associated with class and wealth and beauty\r\n\r\nthe hot girl next door that you grew [up next] too is always named, or should always be named jane",
    "pep": "other [word] for [speed] (amphitamine)",
    "honies": "[Humans] of [New York]",
    "bdp": "\"[Big Dick] Player\"\n\nThe term for a male who thinks they are superior when it comes to the attracting of woman.\n\nBy the ways of Referring to themselves or fellow [counterparts] as the likeliness or similarities of a \"PLAYER / PIMP\" With a [Big Penis]",
    "likwidation": "The coolest and [hottest] [fucking music] [artist] in the world",
    "phuck": "a [homonym] to the old school word \"fuck\" but refers to machine intercourse, instead of genital intercourse. The term is derived from a man named Chris who holds regular discussions called \"phuckathons\" in [Sproul] Plaza of [UC Berkeley]. It's part of an ongoing debate of whether it is better to live in harmony with the earth and someday dying or to live forever in cyberspace as a silicon being.",
    "propmaster": "One [in charge] of [props] for [a play].",
    "alkaholiks": "1) A.K.A Alcholic (For all you people who like spelling korrektlee) A term used for someone who enjoys, or just does it for no reason, drinking [alchohol].\r\n2) [Number 6]. on Xzibits [restless] album.",
    "skunk": "cross breed of Cannabis [sativa] and [Cannabis indica]. [Sativa] is the more traditionally smoked outdoor-grown variety which occurs naturally in places like Colombia, Mexico, Thailand and Africa; Indica is a shorter, bushier variety found in Afghanistan. Unlike pure Sativa, the high it gives is slightly heavy, lassitudinous and [mongy].",
    "wick": "[Short] for [wicked]",
    "crab": "An [insulting] term to [crips], mostly used by us [bloods]",
    "slug": "[Bullet].",
    "cinderfella": "A man who must be home by [midnight] for any one of a variety of [reasons] or he will face serious [consequences]",
    "cristal": "A [very cool], [chill girl] with [awesome taste] in music. Cares about almost everyone she meets and is straight up when she needs to be. She can be a bit bitchy but ends up being the nicest girl around. She's the best in every possible way and pretty rad.",
    "guan": "Originated from [Ireland], abbreviated [slang] for \"[go on]\"",
    "peckerwood": "A [peckerwood] is a rural white southerner, usually poor, undereducated or otherwise ignorant and bigoted, the term gained popularity in the deep south during the early twentieth century and was meant to be derogatory. It is a reversal of the name of the red bellied woodpecker which had a patch of red on the back of it’s head and neck, therefore a peckerwood is a redneck, terms that describe similar groups of people are trailer trash or white trash but neither of those have the same effect or ring to them as peckerwood does.\r\nFrom: \"[Peckerwood] Nation\" www.[dailykos].com \\storyonly/2006/6/28/181447/[773]",
    "zuzu": "the slang term for [goodies], candy, and/or [snack] foods when someone is at a [rainbow gathering].",
    "reel": "Being to awestruck, to [shocked] to [comprehend] [anything]",
    "lucci": "[Bank], [money], [loot]",
    "blaze": "[smoke weed]",
    "gank": "To [steal] or take something that does not [belong] [to you]. ",
    "hoochies": "a female who appears to match a set of characteristics including: trashy, often inappropriately tight dress (with or without [pudge] overflowing waistband); eyebrows shaved and penciled back on in dramatic fashion; heavy, mostly monotonic makeup with dark lipstick; large, gaudy, costume-grade [jewlery].  Frequently accompanied by multiple children from different fathers (see [baby-daddy]).",
    "bumrush": "1) (n) Crash the gates of a show with a pack of people, in the hope to get in without having to pay. \"Yo! [Bumrush] the show\" -- [Public Enemy]. (Yo! Bumrush the show) 1987.\r\n2) (v) To get beaten up by a large, angry group of people. Literally to get rushed by bums or [lowlifes]. ",
    "chev": "(plural [Chevi]; from the French word [Chevalier], meaning Knight or \"mounted soldier\") \n\n1 Two [dots] in a row that signifies a well-thought out or important statement with the intent of being seen by a large number of people, usually on the internet..\n\n2 In text messaging, the two dots denote a statement that expects a response..",
    "steada": "[slang] [spelling] of 'instead of'.",
    "doogie": "[The most] [fly] [mother-fucker] ever.",
    "rikers": "A kind and intelligent male, usually handsome and in his mid [thirties], who makes sexual advances on every attractive woman he comes across, regardless of political, [planetary], or potentialy [alienistic] consequenses.",
    "clowned": "the scariest [fucking thing] [since bread].",
    "thugsta": "[thug]+[gangsta]=thugsta",
    "gangsterous": "There are two types of \"gangster\":\r\n\r\n1) A [wannabe thug], often illiterate and an inhabitant of a [downtrodden] ghetto that hangs around in \"gangs\"; largely associated with the African-American subculture. These try-hard wanna be \"gangstas\" attempt to make themselves appear [like real] criminals by graffiting buildings, smoking/selling drugs and trying to looking all \"bad-ass and macho an'-shit, yo\". An utter degradation of what true gangsters represent (see below), and street wannabe \"gangsta\"-types don't hold a candle to what real gangsters are.\r\n\r\n2) The *real* gangsters are those behind [organised crime]; most notably the Mafia. Responsible for blackmarket trade, epsionage, organised beatings/assassinations, etc. \"The Godfather\" portrays the archtype of true gangsters, showing the brutality of mob beatings, shootings, running rackets and abusing woman, alcohol and everything in between. The real gansters are *not* to be confused with the aforementioned definition, commonly used as it might be.",
    "hobbes": "1. a philosopher who had a very grim view of [human nature]. advocated a totalitarian state. author of [Leviathan].\r\n\r\n2. a stuffed tiger character from the greatest comic ever created, [Calvin and Hobbes] (whom my cat is named after).",
    "projects": "Usually a group of dirty buildings made [for really] poor/homeless people to live in. [Projects] are dangerous,very dirty,filled with gangsters,drug dealers,pimps,hookers and such. The first set of [projects] made(Starret City,made in [1963]) where made for Blacks to live in,but over the years people of all races started to live in projects.",
    "calliope": "1. The eldest and wisest of the Nine Muses of Greek mythology. She is the muse of epic poetry, commonly known as [Homer's] muse, being the inspiration for Homer's [Iliad] and Odyssey.\n\n2. A type of musical instrument which produces sound by sending a gas (either steam or, more recently, compressed air) through large whistles.\n\n3. Title of a story in [Neil Gaiman's] Sandman graphic novels, in which the Greek muse Calliope is featured - although here she is misidentified as the youngest muse.",
    "hamm": "a [slang] word for \"[big pimp]\" or \"great and [powerful]\"",
    "boonapalist": "A woman that [ain't] gonna [stress] her man [none].",
    "swig": "1. Sex With Intoxicated Girls\n\n2. [Hard rock] band from [North Hollywood], California, winner of 2008 [Rock City] News Best Hollywood band award.",
    "gaffled": "to [steal]",
    "haji": "A term to describe a Iraqi people regardless of sex or ethnic background.  Based loosely on the Arabic word \"al-haj\" which means one who traveled to [Mecca].  First coined in [Baghdad] by the [ISG] in May 2003.",
    "hyna": "female, [good looking] girl, women, [a guy's] [lady]",
    "nubians": "A [gorgeous], sexy, [black woman] with an utterly [perfect figure].",
    "beeyatch": "[Stretched-out] phonetical [version] of bitch.  Used for [emphasis].",
    "wak": "super [weird], [awful] and/or [messed up]",
    "diggedy": "All-round [legendary] [person].",
    "diggety": "1. expression of [Chillaxing]\r\n2. a [profound] [utterance] when no other words can be spoken.\r\n3. an adjective for just about anything.",
    "dooke": "[The University] of [New Jersey] at [Durham]",
    "krunch": "When you [bite] a persons [nipple] with your [K-9] teeth. ",
    "richtown": "[Slang] for [Richmond] [California]",
    "zulu": "In [radio] [code], stands for the [letter] \"Z.\"",
    "bolo": "[police] [slang] for Be On the [Lookout]",
    "rd": "A girl of the rare variety who - perhaps inexplicably - \"inspires love\" in a large proportion of the guys she meets. This effect is often partially attributable to beautiful eyes, dimples, a [predisposition] to smile or genuine [friendliness] - but these features rarely account for the dramatic difference between the sincerity of her admirers and others'.\n\nEtymology: Thought to derive from \"hardy\"; any \"RD\" must be emotionally tough (and slightly stubborn) to deal with [the fallout] from her warring suitors.",
    "manne": "[assuming] that everything in a [hotel room] has at one point been in someone's [rectum].",
    "mossie": "([Australian Slang])\r\n\r\nA [Mosquito].\r\n\r\n[pl]. 'mossies'",
    "yippy": "Term created by [Abbie Hoffman] and Jerry [Rubin] in the mid-1960s to refer to \"members\" of the Youth International Party ([YIP]!).  The YIP! was dedicated to merging [New Left] activism and the hippie counterculture to create a revolution that would be both personal and political--as well as fun.  Yippies tended to gather in large cities, particularly in [Manhattan's] Lower East Side, where Rubin and Hoffman both lived during the 1960s.  Yippies rejected all [-isms], including socialism and anarchism, in favor of the motto of \"Do your own thing\"--i.e., don't conform to a specific system of belief but rather be an individual.  At the same time, collective action was at the root of [Yippie] activism, and Yippies participated in \"be-ins\" (normally associated with hippies) and other collective gatherings.  And although the YIP! did not promote any one -ism (and, despite Hoffman and [Rubin's] involvement, was a self-proclaimed \"leaderless\" movement), the \"party\" was extremely leftist, advocating social justice for all and arguing that all property--including housing, clothing, and food--should be FREE.  The Yippies' most famous actions include the attack on the New York Stock Exchange (when Yippies threw money to the floor and watched as those below fought for it) and their involvement at the 1968 Democratic Convention in Chicago, at which they nominated a pig for president.  Much of the Yippies' activism consisted of guerrilla [street theater] and symbolic acts (such as that at the [NYSE]) to make a point; Yippies understood the power of the media and sought press to [disseminate] their revolutionary messages with a pointed disinterest in the accuracy of the stories told about them.  Since the term is rooted in a particular historical moment, calling anyone a \"Yippie\" today would probably be inaccurate.",
    "herb": "used by rapper [esoteric], in the song herb. pronounced like its spelled, no silent h. it doesnt mean weed or drugs, its a term for someone who follows trends, or just is a complete [bullshitter].  [basicly] one of those kind of people that nobody likes.",
    "rhymer": "A nickname for [Chuck D], [the MC] of seminal rap group [Public Enemy].  Compared to other MCs, Chuck spits harder, more serious game.",
    "doodoo": "[poop]",
    "stickin": "When a car looks good,clean,raw..\n\nOriginated in [Miami] and used there often when someone [see's] a car that looks nice with big [rims] clean with rims etc..",
    "maryjane": "[another] [term] for [marijuana]",
    "bootch": "A term combining 'bitch' and 'hootch' to describe [a good friend] or [extreme] asshole without [cursing]",
    "tch": "The sound made by [pressing] the [tounge] against the front of the roof of your mouth, [applying] pressure, and releasing. This is normally used in times of frustration or disatisfation.",
    "blitzed": "Of [being high] or [wasted] [to the extreme].",
    "boon": "A [derogatory] [term] for a [black man].",
    "ganked": "To [steal] [something]",
    "killuminati": "Pac was talking about killing illuminati. Illuminati is the elite ruling circle, the 34th degree of the [Freemason] click, which is a century old brotherhood of anglo-saxon protestants. He was tellin you to kill that shit. They're the cats that maintain all the inequality and oppression, supposedly. He came out with this whole theory after his prison stint, and after reading [Machiavelli's] 'The Prince.' [Now it's on] us.",
    "noyd": "A noyd is a person that annoys others for [no good] reason, sometimes for fun.  Some cases are differant as certain people are annoying [naturally] without any effort or knowledge that they are in fact an annoying [jackass].",
    "creeping": "Following what is going on in someone's life by watching their status messages on Instant [Messengers] such as MSN, and their updates to their [social networking] profiles on websites like Facebook or MySpace.  Akin to stalking in the real world, but usually done to people who are your friends that would normally share this information with you, however you're just too busy to [keep up] conversation with them.",
    "bido": "1. speed, [crank], meth\r\n\r\n2. a general term used to describe any drug\r\n\r\n3. an [ambiguous] emotional state used to describe any [sentiment]; can be used like the slang usage of \"bad\" (can mean good or bad)\r\n\r\n",
    "buckwhylin": "(v.) Being [buckwild], as defined by [Busta Rhymes]. Being rather out of control in an [irrational] manner-- possibly drunk and/or on drugs of some sort.",
    "heru": "Heru is a god in [Egyptian] [mythology]. A [protector], loyal, fierce and good.",
    "mowf": "[Mouth].........[damn], use your [imagination], dude.",
    "nce": "[The beat] of the music at raves. (I.E. The beat in the bass)\n\nAlso for dirty music, and [house music]. Anything with a loud bass and a [good beat].",
    "rpt": "Commonly referred to as EST or East Standard Time, [RPT] ([Real People] Time) is the authority in time zones. It is the [benchmark] for Television, Sports and business/financial time references, and is thus the most important time zone in the world.",
    "slj": "The abbreviation for the best [black man] in the whole [galaxy]:\n\n[Samuel L. Jackson].",
    "banton": "a heavy-weight [lyricist]",
    "ripsta": "A [Pseudonym] used by former [Bone Thugs-N-Harmony] member, [Bizzy Bone]",
    "slugs": "[Bullets]",
    "loc": "a.) a term [crips] use to call eachother.\r\nb.) a [crip] term meaning crazy, wild or insane\r\nc.) the leader or OG of a [crip gang]",
    "fronted": "[Put on] a fake or [false] personality; not [keeping it real].",
    "moose": "An extremely powerful, noble, and majestic creature that emjoys [frolicking] in the woods, grazing in fields, and [break dancing] to [old skool] hip-hop.",
    "packin": "v. To hold or to have. Can be used [variable] contexts, from having a weapon to having a large [body part].\r\n\r\nSee [packing].",
    "makaveli": "Definition: Makaveli\r\nThe predetermination of Tupac Amaru Shakur (Date of Birth name: [Lesane Parish Crooks]) that his life or death would lead to the beginning of a wide spread phenomena of a [thug nation] created by his definition.  \r\n\r\nBackground:\r\nTupac’s name originated from the politician, Niccolo Machiavelli who was born on May 3, 1469, in Florence, Italy.  His life was dedicated in his passion to politics.  \r\n\r\nFurther Detail:\r\nThe Phenomenon of a reincarnated soldier goes beyond the definition of his accredited name.  The Makaveli era of Tupac was his verbal will-in-testament to the world, specifically to the urban kids, teenagers, and gangsters of America, to unite.  The reincarnation is also a definitive symbol of his ongoing passion to his cause even after death.  Makaveli’s lyrics and his passion mirrored his beliefs, values of being a thug, and his humanity.  Hence, Makaveli was his own beginning of a new life and the finalization of a completed cause of becoming a true thug.  Overall, the Makaveli – Tupac Era was prematurely ended during his death in Las Vegas.\r\n  \r\nBorn: June 16, 1971 in Brooklyn, New York.  Death: [September 13, 1996] in Las Vegas, Nevada.  R.I.P. “The Last True Thug.”",
    "zeekers": "Zeekers are always right.\r\n\r\nA Zeeker should be respected by all non-Zeekers.\r\n\r\nA Zeeker is one who [zeeks].\r\n\r\nWhat the art of zeeking is, is at this time unknown.\r\n\r\nA Zeeker must first pass the 5 [Trials] of [Zeek].\r\n\r\nWhat these [trials] are is unknown, the Zeekers have to decide what the hell zeeking is first, don't rush them.",
    "chickity": "[Chickity China] the [Chinese Chicken], ya have a drumstick and your brain starts [clickin]",
    "chiggie": "Chiggis ,Plural Chiggi, is a rare [delicacy] found only in the rolling estates of [Runcorn].  Its a cross between chicken and [haggis]. Usually Eaten covered in gravy.",
    "danked": "To keep a forum [post] on the top of [the list] by using [alternate] accounts to post replies to your original post.",
    "porgie": "One of the greatest activities in Aldus [Huxley's] [Brave New World]. When people get together, sing, take drugs and have [group sex], they call it an orgy porgy.\r\nSee also: gangbang",
    "kevorkian": "1. Jack Kevorkian-suicide doctor.\r\n-or-\r\n2. Caia-Closet Paint Nazi, [fortune cookie], and everyone's favorite drummer. And yes, [she ready] ([what what]?) fo' yall.",
    "girbauds": "A Brand of Jean made by Marthé et [François] [Girbaud]. Gangsta jeans, which people in the hood and in the inner cities will be seen wearing. The most popular [girbaud] is the shuttle jean. The shuttle is the jean that has the knee and ankle straps that say \"[M+FG]\". They come in different colors to match your outfits.",
    "phonics": "A [base] [word that] pertains to sound, [communication], and pronunciation.",
    "movado": "an [intricate] swiss-made watch often referred to \"the [museum] watch\"  Has no numbers, because [rich people] do not have to be on time.  They are usually the boss.",
    "serv": "To be beaten in a sudden, [out of the blue] competition. No previous knowledge is required on a subject to be [served]... Once somebody is served, and then this person serves back, then [its on].",
    "bubblegoose": "an [overstuffed] down [jacket] or [coat]",
    "cluckers": "2. A drug-addicted [person], most likely [hooked] on crack-cocaine. A [crackhead].",
    "mally": "Beautiful small confused girl. Bright [eyed] and loud. She is [stunning]!! Any boy would be lucky to be with her. She's a girl you'd only find [in your dreams].",
    "cat": "The definitive pet. \r\nCleans self. Knows how to [catch it's] food.\r\nProbably gave humans the idea for a \"[vaccum].\" Is intelligent and curious. \r\nLikes to lay around alot, sort of like a [couch potato]. That's cool though.\r\n\r\nThey are usually quiet and know where to use the bathroom, unlike dogs.",
    "puffin": "A great boyfriend who is very [playful] and strong but [so cute] and [cuddly] at the same time!",
    "levas": "A term used by [Chicano] urban/[barrio] youth to mean that a member of a group has turned his/her back on the rest|meaning that a member of a gang/group has disappointed his/her peers by joining another group/gang.\r\n\r\nCan Also mean: a traitor/ \"sell out\" / \"[ranker]\" / \"biotch\"",
    "stee": "[Alternate term] for [style]",
    "spliff": "also [splif]\r\n\r\n(From split <divided> + spiff <well-dresssed or good>)\r\n\r\na quality cigarette rolled with both tobacco and marajuana, initially popular on [Europe's] [Iberian] Peninsula\r\n\r\nadditionally, the term has been adopted to mean any high quality or well-rolled marajuana joint",
    "chump": "Someone who does not understand the [basics] [of life] on [earth]. Confused easily.\r\n",
    "frontin": "[Urban slang]. To put up a [facade] or make appearances, typically to impress or in some way [deceive] to maintain image. From 'to front'.",
    "nitty": "a nitty is someone who [people] [sell] [drugs] to",
    "flipmode": "Consists of: Rampage, [Lord Have Mercy], Rah-Digga, [Spliff Star], Baby [Sham].",
    "rakim": "[The best rapper of all time]",
    "ficky": "[Quick], [emotionless] [sex].  ",
    "ppp": "[Puff Puff Pass]",
    "bug": "[Bug]\r\n(to [pester])",
    "porridge": "To [serve] [time in] [prison].",
    "peckin": "When somebody doing some stupid, weird, or [uncalled for] shit. [Trippin] or [fuckin] off.",
    "peeler": "a member of her [majesty's] constabulary: a police officer; especially in the United Kingdom and Australia. Derived from the name of Sir Robert Peel who developed the [Metropolitan Police] Act in 1928 which proved to be [the foundation] for the modern police force in Britain.",
    "sumpin": "These little [ditties] can be used to describe something [very special].  Like a new car, or an [evening] out.",
    "vicked": "7 [grams] of a drug, usually cocaine.  comes from the number, 7, on [michael vick's] jersey.\r\n\r\nsee [quarter ounce].",
    "bucktown": "[Brooklyn], [NYC]. ",
    "guantanamera": "1) [Pretty girl]\r\n2) [A popular] [Spanish] song"
}