{
    "dro": "HyDROponically grown marijuana, i.e., \"[homegrown]\". Pot grown indoors in [hydroponic] chambers, which regulate light, humidity, and temperature. Usually a higher, more [pure quality] of weed than that found elsewhere. Whether there are additives such as cocaine in it is a secondary matter - ask honest questions of your dealer. When in doubt - don't buy.",
    "cuz": "[cousin]; friend; [brotha]; [homey]/homie",
    "wickie": "Also known as the \"baby scratch.\" A DJ [scratch that] only involves moving the vinyl back and forth without using a [fader] or [transformer]. Usually the first scratch that is learned by a novice.",
    "dipset": "[a word] to be used when [leaving] [the scene].",
    "mon": "[Jamaican] [way] of [saying] man.",
    "grind": "A [group] of [lesbians].",
    "crunk": "In 1995, Conan O'Brien and [Andy Richter] were scheming ways to get past the TV censors on [Conan's] late night talk show, and they settled on an all-purpose, suitable replacement for the infamous seven dirty swearwords that they couldn't say on TV: Crunk. The choice to use that word was definitely not random. [Ice T] just happened to be on the show that night, and he likely fed the word to them beforehand and certainly helped fuel its popularity during the telecast (\"That was seriously [crunked up], right there.\"). But Ice never claimed to have come up with the word--he probably got it from Dirty South rappers, who had been using it for years as a euphemism for getting really crazy and fucked up on marijuana and alcohol (stoned and drunk. Chronic plus Drunk = Crunk). Or maybe crack and drunk. Or coke and drunk. Or maybe just being crazy and drunk. Whatever it is, it means getting really crazy and fucked up. And with Conan's introduction of the word to northern suburban audiences, Crunk came into its own as the recognized sound of the new generation of Dirty South Rap, prompting white college [fratboys] everywhere to wander around going \"WHHHUT!! OKAAY!! YEEEAAHHH!!\" [like annoying] dipshits. and it's all thanks to Lil Jon, and by Lil Jon I mean Dave Chappelle.",
    "mayne": "Comes from the movie [Scarface], where [Cubans] [pronounce] the word \"man\" as \"mayne\".",
    "koopa": "1. Nintendo characters; A race of turtle-like reptiles that come in all shapes and sizes. Most of them are [Bowser's] servants, but there are also a lot of good Koopas. Bowser's Koopas have many various soldier ranks, most common of which is \"Koopa Troopas\" (which is another word for \"troopers\", if I'm not mistaken).\r\n\r\n2. Koopa is also the name of their king. Koopa or [King Koopa], also known as Bowser or Lord Bowser. But anyone who watched old Mario cartoons or played Super Smash Bros. Melee on Japanese mode knows that already.\r\nAhem. Anyway, his full name (as far as I know) is [King Bowser] Koopa.",
    "rims": "[The chief] expenditure of [African Americans] (according to [Chris Rock])",
    "weezy": "1. Character on [The Jefferson's] the wife of [George Jefferson]. Weezy was short for Louise the name Weezy was givin to her as a nickname by George.\r\n\r\n2.Lil' Wayne aka [Weezy F. Baby] self-proclaim Best Rapper Alive Considered by many the hottest thing in music today\r\n",
    "chamillionaire": "The [illest] [southern] [rapper] period!!!!!",
    "nolia": "Refers To A Housing Project In [New Orleans], Called The [Magnolia] [Housing Projects].",
    "hustlin": "Havin the [ambition] and drive to do everything and anything to make [mad money]. See [hustler]... Also a term used for \"tryin to obtain sum booty\".",
    "tipdrill": "girl with a great body but a fucked up face.  Related to a drill.  The head of [the drill] is fucked up because it's been [drilled] so often but the body is still in [tact].",
    "cats": "He [set us up the bomb]. Also [took] all our [base].",
    "crank": "Slang, noun.\r\n\r\n“[Crank]” is slang for a low purity, [crystallized] Methamphetamine that is administered in a powder form. Crank, like all other Methamphetamines, is a stimulant that acts on the central nervous system to increase heart rate and alertness of its users. Highs on the drug last between 8 and 24 hours, and often include a violent \"crash\" period where the user tends to be prone to aggression. The drug received the nickname “[crank]” because it was often [smuggled] in the crank cases of vehicles.\r\n\r\nMethamphetamine is taken orally or intranasally (snorting the powder), by [intravenous] injection, and by smoking. A common misconception among users is that some administration methods are safer than others, while in reality all act on the body the same exact way. Methamphetamines damage nerve endings, which cause naturally occurring neurotransmitters—[Dopamine] and [Serotonin]—to be ineffective. Because Dopamine and Serotonin are responsible for [easing] pain (like the pain which comes from drug withdrawal), withdrawal periods are extremely painful because the body does not have its natural pain reliever to administer. \r\n\r\nMethamphetamine withdrawal is said to be one of the most painful experiences a human being can endure, and users of the drug should should consider other safer recreational drugs.",
    "chamillitary": "[Chamillionaire's] little known debut album, also the name of his crew for being able to blend in with thier environmend whatever hood they be in. Not to mention a state of mind held by any fan of [Chamillionaire] himself, new [king of the south].",
    "gilla": "gilla is [short] for [gorilla]; it means [over the top]\r\n\r\n",
    "sheek": "A misspelling of [Chic], as in [fashionable] or stylish. If you spell [chic] this way, you most likely have no clue what chic means or you have the same name as a city in France.",
    "nna": "Not [Nazarene] [Appropriate]. Anything of a manner not approved by the Nazarene [Manual].",
    "hov": "another name for [rap artist] Jay-Z.  he is alternatively referred to as \"J-Hova\" as he considers himself to me [the messiah] of [hip hop music].",
    "cris": "Someone who is loyal to all of his friends. Who always has [something funny] to say. Someone who can always give you some great [advise]. You should be very proud to be with friends with a Cris. He has a sexy smile and his big tan arms are the best place to be. He is an amazing man and [deff] the best husband ever! He has the greatest personality ever and is very fun to be around!",
    "beef": "to have a [grudge] or [start] one with [another] person.",
    "yada": "So on and so forth. Used as a replacement word for an action that is either too obvious, [banal] and/or [equivoque] to speak aloud.  Usually repeated; \"[yada, yada, yada]\". Is to action what blah is to spoken words.",
    "inc": "[Short term] for \"[incoming]\", used in [online gaming] (specifically, MMORPG) to state that enemy monsters or players are incoming.",
    "candy": "n.\r\n\r\n1. [euphamism] for sex\r\n2. something (usually [flashy] like a [lure]) used to get sex\r\n3. drugs, particularly cocaine, crack, or E",
    "wodie": "\"friend or partner\" ... used by [Juvenile] from [Cash Money] [Records]",
    "whodi": "Used to designate friends.\r\nOriginally from New Orleans, comes from the word \"ward\" (as in [9th Ward]). Someone who lives in one of the wards is a wardy. Eventually becomes common slang, often used in southern Hip Hop, specifically the members of the now defunct Hot Boys (B.G. a.k.a. B Gizzle, Lil Wayne a.k.a [Weezy Wee] and Juvenille a.k.a [Juve] the Great)",
    "bis": "Gaming acronym for [Best in Slot].\r\nIt refers to a piece of gear that is the best piece you can [equip] on a specific place (like a weapon, or a piece of [armor]).",
    "ova": "Short for Original Video [Animation]. \r\n\r\nAnime that is not [aired] on TV and can only be seen on [VHS]/DVD.",
    "laflare": "a [stylish], [observant] individual\r\n[french] for \"awesome\"\r\n\r\n",
    "zoop": "See [Brap]. \r\nUse When Bigging Someone/[Thing] up.\r\nOr When You are [Excited].\r\n",
    "lowrider": "Now days [lowriders] are almost any car with hydrolic pumps added to it. but lowriders were invented by a mexican person who hooked up a old school car usually a impala from 59 to 76 and slapped a candy paint [coat on] it with some 14inch or 15inch dautons some sic ass [hydrolics] and a bad ass interior but now days everyone from black to yellow has lowrider but remember they come from the south homes.",
    "jazze": "[The only] [truth] left in [music].",
    "vita": "The girls name Vita\\v(i)-ta\\ is pronounced VEE-tah. It is of [Latin] origin, and its meaning is \"life\". Mostly Italian use.See also [Vidal]. Vita can mean 'the happy life'.\r\nThe ultimate in [perfection]. An amazing mother, beautiful, intelligent,sexy and fun person that you can't help but want to be around all the time.",
    "louch": "1. A person that refrains from [activity] or does [nothing]. 2. To [refrain] from activity or do nothing.\r\n",
    "diallo": "A caluclated [player] who uses his [good looks] to use women. It is said that its eyes can [hypnotize].",
    "clayborne": "An amazing person who will do the craziest things to make those around him happy. [Clay] is unique, cute, [wicked smart] and hilarious. Clay is someone who can make anyone laugh and smile even if their cat just died. An adorable dork who's a complete nerd but also a wonderful and one of a kind King who's got magic in his pocket and [sunshine] in his eyes. Also, just a really cheesy dude overall.",
    "dough": "[Money]. [See] [doe].",
    "swang": "[Steering] your car [side to side] when driving. Mostly done when [cruising].",
    "dade": "A county [in Florida]. Referenced in multiple songs, \"[It's going down] in [Dade]\" for instance.",
    "spittin": "the act of or [urge] to [freestyle] or [rap].",
    "gorilla": "An extremely [muscular]/[buff] person, also called \"juiceheads\". Frequently used term [on the Jersey Shore].",
    "escalade": "one of many large cars that men [purchase] to [conceal] the diminutive\r\nnature of their \"[manhood].\"",
    "trak": "[Neptunes] [music] [label]",
    "mayn": "Comes from the movie [Scarface], where [Cubans] [pronounce] the word \"man\" as \"mayne\".",
    "canibus": "Canibus is known for his scientific and philosophical approach to hip hop. In many of his lyrics, he uses scientific jargon and often creates intricate rhyme schemes, complex phrases and concepts in order to provide an artistic depth to his music. [Punchlines](a key aspect of freestyle and [battle rap])and vivid imagery are other trademarks of Canibus' rhyming style...Not to mention, the razor-tongued battle specialist has the largest vocabulary in Hip Hop, a penchant for absolutely killer wordplay, and a stamina that allows him to rhyme for minutes on end.....Anybody who knows [REAL Hip-Hop], know that Canibus is the G.O.A.T",
    "nying": "*1*stands [fo'] New york\r\n*2*Newyork [Yankee's]\r\n*3*the hottest hat to be [reppin']\r\n*4*east coast",
    "edo": "The japanese nickname of the [protagonist], [Edward Elric], in the Anime [Full Metal Alchemist].",
    "clipse": "A pair of wicked rappers from Virginia, who go by the names Malice and [Pusha T]. (who is also called Terrar) \r\n\r\nThey do a lot of joints with [N*E*R*D], particularly with that guy [Pharrell].",
    "kno": "[Jamaican] patios; slang meaning \"[of course]\" or \"[I know]\"",
    "gnac": "[short] for [cognac]",
    "fizzy": "A woman when in a relationship becomes completely obsessed with the dude that she would even go that far and pretend everything is fine and make up bullshit lies.\n\nAlso friends are nothing to her and as soon as she thought of a way to make things better for her by turning on her [true friends] she will.\r\nShe only cares for herself and she would even go so far she'll give a man [naked pics] [for fake] coins on a damn game.\r\nWhen reality gets to much for a \"fizzy\" she usually runs of to her own world a game, perhaps [yoville]. That game soon takes over most of her life and makes her neglect her real kids. Even in this [new world] she still the same selfish obsessive person but she hides it very well. Especially from her friends. She's good at lying and know what she does and how to start drama. She's not trustworthy.\r\nIn real life her general appearance makes her look as if she's done meth all of her life but really she was just born ugly and lets not forget her BUNKEYE.",
    "meat": "1) The [male sex organ]\r\n2) A [substitution] for any other noun verb or [adjective]",
    "phizzle": "A word created by producer [Jazze Pha] that became annoying after it was used in every song he produced. It means \"this is a Jazze Pha production\". Made famous by [Ciara's] \"[1,2 Step]\".",
    "burners": "pay-as-you-go [cell phones]; a [disposable] [phone].",
    "phonte": "A [visual] text style used in [instant messaging], message boards, etc. Except it looks a whole lot better than everyone [else's].",
    "tippin": "i would liek to correct everyone [who ha] written a definition for [tippin]. [Tippin] is when one side of ur car is lowered so it tips to one side. Hence the name tippin. You guys are thinkin of [swangin]. THats when you swerve from side to side to show off ur car.",
    "madlib": "Quite possibly the [dopest] West Coast producer ever (yes, better than Dre).  Handpicked by [Stones Throw Records] owner [Peanut Butter Wolf]",
    "blat": "[A Russian] word that can be used as a noun, verb, or adjective. Its [primary] meaning is a whore. However, it can also be an expression of [frustration] or used for fun after a sentence.",
    "lazerface": "describes the high from [mushrooms] containing [psilocybin], or [magic mushrooms].",
    "pillish": "to [feel] high, [as if] you are on [pills] of some accordance.",
    "sigel": "Beanie Sigel is a [Philly] born rapper who is currently signed to [Rocafella] records and is [head of State] Property.",
    "truth": "Something which would probably [upset] a great many of people [if it] were known and made [public].",
    "maiz": "a type [of corn] [grown] by the native amercian [indians].",
    "juelz": "A member of the [rap] group [Harlem] [Diplomats].",
    "thoed": "[Short] for 'though.'  Most often found in IRCs,[IMs], and [blogs].",
    "nizzle": "1.  [nigga]",
    "obie": "The term used to [identify] students at [Oberlin] [College]",
    "rasaq": "Rapper [Chamillionaire's] brother, which stars in Chamillionaire's latest CD, \"[The Sound of Revenge]\" ([track 13]). Also stars in many of Chamillionaire's previous mixtapes.",
    "squ": "someone born with [unfortunate] [angles] on their head to make them look like [a cube]",
    "whoadie": "(wo' - day) slang; A term originating in New Orleans. In most cases where the word \"dude\" \"bro\" or \"homie\" would be used, whoadi can be substituted. Has often been incorrectly spelled \"[wootay]\" \"[woadi]\" \"wotay\" and \"[whodi].\" It is not uncommon for New Orleans natives to shorten the term to just \"wo.\"",
    "derrty": "A word we like to use in [the Lou] (that [STL])\r\n\r\nIts A [ST LOUIS] THING",
    "bebot": "[Bebot], A [Tagalog] word from the Filipino culture meaning \"Chick\", \"Babe\", or \"[Boo]\". \r\n\r\nPronounced as \"Beh-boht\"",
    "cashville": "The city [Nashville], Tennesee\r\n\r\nalso [CA$HVILLE]\r\n\r\n([Young Buck])",
    "storch": "One of the greatest hip-hop producers out there rite now.  Former Roots keyboardist. Responsible for joints like Lean Back, poppin' [them thangs], [still d.r.e], etc.  and endless jay z, dre, snoop, busta hits.  Says \"a Scott [Storch] song will never appear on a Ja Rule album again\" as he is so strongly asociated with shady/aftermath family.  Dating lil' Kim.",
    "phunk": "word used by the black [eyed] [peas] instead of [the f word]",
    "dilla": "[The Michael Jordan] of beatmaking.\r\n\r\n[Rest in Peace].",
    "buk": "Buk-Lau made Owangepranks famous for his \"[Angry Asian] [Prank Call]\". Buk-Lau is a asian [man voice].\n\nWatch it on YouTube",
    "koch": "1. To hang around / [stay] / [chill] [somewhere] or with someone.\r\n\r\n2. When a place is nice to stay.",
    "wamp": "To use one's [phallic] member in a club-like or swinging motion in order to [bruise] an individuals eye (give them a \"[black eye]\")",
    "artis": "When some redneck country [sounding] person says the word \"[alrighty]\", it sounds a lot like \"[artie]\".",
    "teef": "What [Flava Flav] has in his [mouf].",
    "swishahouse": "Swishahouse Records is an independant record company which started in northern Houston in the late 1990s.\r\nThey made \"[chopped and screwed]\" music popular in northern Houston after other record companies started the music style in southern Houston.\r\nThey have held record deals with artists like [Chamillionare], Mike Jones, and have a record deal with [Paul Wall].",
    "murs": "The most [humble] rapper out there.  He has a [unique style] and [great story] telling.",
    "kuniva": "[Kuniva] aka Van Carlisle is the most discrete but nevertheless gifted member of the D12 group. Also going by other aliases such as [Rondell] Beene , Hanz G, Kuniva used to belong to the Da Brigade group along with his fellow friend [Kon Artis] aka [Denaun] Porter before joining the D1é group.\r\n\r\nAlong with his common work with D12, Kuniva has a lot of underground work at his active.\r\n\r\nHis sharp, incisive lyrics particularly come to shine in his recent solo songs entitled Feeling The Rush, Hard As Mine and Bad Intentions.\r\n\r\nKuniva truly deserves to be known better as a solo artist.",
    "posta": "1) \"Supposed to be\"\r\n2) \"[Poster] Boy\" -- A person who is an example of something\r\n3) \"Poster\" -- In [regards] to basketball terms.\r\n4) A Rapper from [La Puente, CA]",
    "rahzel": "Very talented [beat box] [artist], who is [even more] famous.",
    "skwad": "skwad means family. skwad means [no one] gets [left behind] or [forgotten].",
    "yums": "Blowjob.  Used in [3rd world] nations as a euphemism.  Most commonly used in [the sex] trade of the far east like [thailand].",
    "impala": "Impala : A [marvellous] car by Cheverolet Motors. [Luxury] and speed [all the way].",
    "briar": "(noun) A Briar is a reference used in southwest Ohio and southeast Indiana to refer to a white person of Kentucky (usually [Eastern Kentucky])and sometimes even East Tennessee, Virginia or West Virginia heritage. The term has a certain amount of irony because much of the areas where the term is used are chock-full of Briars. It's the N-word of white folks in parts of the [Upper South]. If you are a Briar, you may call another Briar a Briar, but if you are not a Briar and call another a Briar, them are fighin' words! \"Briar\" is especially well known in [Dayton Ohio].",
    "chamillion": "The amount of money [Chamillionaire] made [off of] his hit [record].",
    "peachfuzz": "1)fine hairs, usually referring to the first [emergence] of facial or pubic hair on an [adolescent]\r\n\r\n2)[FFXI] character on the Valefor server",
    "biznite": "a biznite is [basically] [a bitch], to [put it] lightly",
    "squalie": "when [cops] around [yell] out Squalie to [warn] other people that cops around.",
    "twurk": "to move your body [in a way] that you are [rubbin] up against [somethin] or someone",
    "poobs": "A [pube] coverd in [poo].",
    "shap": "Originating from the words shop and talk, it began used when discussing all things [relevant] to the [Vancouver Canucks]. It has now [evolved] to be used in countless other applications (see examples).",
    "raspy": "1. words or language having little or no sense or meaning.  \r\n2. [foolish] or [absurd]  \r\n3. talk nonsense in an attempt to [deceive] or threaten",
    "tray": "In slang often used for \"three\". [Tray Eight] is for example a .38 [cal] [handgun].",
    "caine": "1. To be overlooked despite outstanding performance due to being overshadowed by teammates thanks to the ignorance of the media, such what frequently happens to [San Francisco Giants] pitcher Matt [Cain] after pitching a good game.\n\n2. Alternatively, it can refer to having one's [good work] spoiled by teammates' incompetence, such as when Matt Cain gives up only two runs but nonetheless loses due to a lack of run support.",
    "fizzle": "[Another word] for [a fool]",
    "wizzle": "a [term] for [weed] or [marijuana]",
    "hyphy": "Main Entry: hyphy\r\nPronunciation: \"HIGH-fee\"\r\nFunction: adjective\r\n \r\nEtymology: Etymology: San Francisco Bay Area, shortened perhaps from English dialect \"hyperactive\"; other sources cite a combination of \"hype\" and \"fly.\" Popularized by E-40 and the [Federation's] song \"Hyphy\" (2004); first known use on record by [Keak Da Sneak] in 1998 (on \"Cool,\" from his LP Sneakacidle).\r\n1 : dangerous and irrational: CRAZY;\r\n2 : amusingly eccentric; without [inhibition]: GOOFY",
    "kong": "A movement in the art of [Parkour] designed to clear an [obstacle] using the hands. Execution involves running towards an obstacle of about waist height, jumping about [1-2] feet before the obstacle and placing the hands on the desired object. You should then [tuck] your knees in towards your chest and your momentum force your body forwards. When clear of the object, release your tuck and prepare for landing by slightly bending your legs and extending your hands to absorb the impact. If performed from a height, a roll should be implemented to reduce shock further.",
    "bapes": "short for \"[Bathing Ape]\".\r\n\r\nclothing company founded by Nigo. made popular by such celebrities as [Pharell Williams] (Neptunes, N.E.R.D.).\r\n\r\n(bapes): the air force one looking shoes by the [bathing ape] company. also called: bape sta.",
    "fayettenam": "[Fayetteville, NC] a military city dependent on [Fort Bragg] and Pope [Airforce] base.",
    "frayser": "[Frayser boy] is one of [the baddest ass] rappers from [HCP], hes reppin the bay and has some wicked wild flows.",
    "weddy": "Nickname for the very best of [teddy's]. He is the top of [the teddy] pyramid and is just amazing at everything. You can't argue with one or you will lose; Can't get mad at him (or stay that way for long). He will put all [Teddy's] to shame and make you feel wonderful in every way. He is the most perfect of all guys. He makes girl feel lucky to have him even for a moment. Time spent with him is like a [fairy tail] and forever seems too short. He becomes everything you ever want and need, and you cant imagine life without him. He will make you want to become a better person and do anything it takes to keep him with you. He is the most perfect thing in the universe and that could never change, not even in a million years.",
    "wheezy": "Wheezy Waiter is Craig Benzine, a video content creator, who has a popular channel on YouTube and a blog under the name Wheezy Waiter. Craig has been creating Wheezy Waiter videos since June 2007.\n\nWheezy Waiter is as popular as other video content creators who are defined on Urban Dictionary.\n\nCraig calls himself Wheezy Waiter, because when he started creating videos for the internet, he was working as a waiter and because he has asthma. (He no longer works as a waiter.)\n\nIn his videos, Craig often creates vocabulary that catches on very quickly and begins to be widely used on the internet, including the terms [doobly-doo] and [noodle boiler], which already appear on UD.\n\nWheezy Waiter videos have many repeated themes, including: use of slap bracelets to celebrate, clones of Craig punching each other, winks that make a dinging sound, music playing when Craig's chair slides across carpet, Craig playing a version of his mother who stands at the window and profanely criticizes him, and lots of attention [to Craig's] beard, which has become [Wheezy Waiter's] trademark. (Wheezy Waiter viewers are referred to as beardlovers.)\n\nThere are also long series of videos on a single theme, such as a long series of videos he did of song puns using breakfast items (Eggs over Easy E, Braneater, Iggy Pop Tart, Barack Obomelette, to name a few). His longest-running series is [Free Bagel Friday], when he punches his boss to steal his boss' bagel.",
    "ugk": "UGK (short for Underground Kingz) are a hip-hop duo born and raised in [Port Arthur], Texas. Formed in 1987, by long-time friends Chad \"Pimp C\" Butler and Bernard \"[Bun B]\" Freeman, they are highly respected by many of their peers, due in part to their longevity and their entrenchment in [hip-hop's] underground. They also invented the word, \"Trill.\"",
    "beesh": "a close friend, a [homie] [if you will].\r\nSomeone you can always depend on, [your boy].",
    "magno": "describing something that is [super],great,[magnificant],[awesome]",
    "utp": "[Up-Town] Projects. Juveniles record label with starting artist Wack-o and Skip. their single [Nolia Clap] can be heard on the radio often. Younbg Buck was once a [memeber] befor defecting to G-Unit.",
    "rep": "1. [Represent].\r\n2. [Reputation].",
    "cheddar": "money, [riches], can also be used to [express] [satisfaction].",
    "feria": "Money, [mostly] used by [Latinos]\r\n\r\nA [fair]",
    "wanksta": "A \"wanksta\" is a very basic word meaning a person who acts/looks like [a gangster] or thug, but has never done anything gangster or thug-like besides acting or looking like one. It can be towards any race or ethnicity. The word does NOT imply a [WHITE guy] [acting black]. ",
    "llac": "what ludricrous still is even in late [2004] with the [release] of \"[Get Back]\"",
    "mannie": "[A funny], charming, [cute guy]. All the girls [love him]. ",
    "dtp": "aka [disturbing tha peace]\r\n\r\nthe best rap label in the world, also owns the [holidae in].  Ludacris owns it, [chingy] is a member too.",
    "whips": "being completely controlled by your [girlfriend] or [boyfriend]...in most cases [a guy] being completely controlled by his girlfriend.",
    "gouda": "[Yaper], cheese, cheddar, [chalupas], green, money, cash. Word comes from E-40 the father of [slanguage].",
    "riggy": "When you [titty fuck] a girl with [double D's] at [least].",
    "chigga": "What people call \"[Asians] who are influenced by urban [hip-hop] culture\" when it means \"Asians who want to [be black].\" They say chigga because of the -Ch in Chinese and the -Igga from Nigga. They think that any asian who likes hip-hop is dying to be black.",
    "commi": "[Derogatory] name for a [Communist]. \r\n\r\nRelated words : [Pinko]",
    "frikki": "[South Africa] [slang] for [condom].",
    "vik": "A signature drink created by a New Yorker. The drink includes ice, Three Olives Grape vodka, [club soda], & a splash of [cranberry], preferably in a [Solo cup].",
    "capo": "[Caporegime] / [capo] is a name for a captain in the mafia [family, the] family will consist of many captains and the boss which is a capo crimini.",
    "sheezy": "Modification of the [ebonic] word \"[sho]\" based on English word \"sure.\" All phrases containing two consecutive words ending in an \"O\" sound should be modified so that the second \"O\" becomes \"[eazy].\"\r\n\r\n",
    "ti": "TI a rapper from [ATL]. He always seem to diss everyone like [ludacris] and [lil flip] but still a very good rapper.",
    "ih": "[Abbreviation] for 'Ihsous', [Greek] [for Jesus].",
    "ballers": "A [thug] that has \"made it\" to the big time.  Originally refered ball players that made it out of the streets to make millions as a pro [ball player], but now is used to describe any thug that is [living large].",
    "nou": "\"[no you]\"",
    "timbs": "The shortened [version] of [the shoe], [timberland]",
    "hollerin": "this [word] means wow, or [jeepin'] gillickers, [wally]!",
    "gators": "Shoes made of [alligator] or [crocodile] leather, worn by [pimps] and other players.",
    "donk": "a very round, attractive [ghetto] syle [booty] \r\n\r\nderivation: shortened form or [badonkadonk]",
    "jag": "an irritating individual with no sense of a social [filter] and no [realization] of the implication of his actions; [socially inept].",
    "brawl": "A [melee] fight, usually a [fistfight], but not always. Can involve only two people, not necessarily more as [stated] in the other two definitions.",
    "nextel": "a cell phone service with terrible service in all areas except major cities. a service with [overpriced] [phones], overpriced plans, and [oversized] phones.",
    "clef": "Hole in the roof of the mouth caused during development [in the womb]. Often accompanied with a [Hare] Lip, an [open space] in the middle of the top lip. ",
    "fillmoe": "Slang name for the Fillmore District of San francsico now commonly known as \"[Western Addition]\" by city planners and gentrifiers. Once the prominent black - African American hood in Frisco before SF redevelopment agency enforced [eminent domain] (event known as \r\n\"black removable\" by long-time ex/present black residents. Now known for anything south of [Geary] Blvd to Fell street. ",
    "mouf": "[ghetto] for \"[mouth]\"",
    "underdig": "To \"Understand\",is to Dig(like it or not) what a person is saying.\r\nTo \"[underdig]\" is a total comprehension of what someone is sayin'.\r\n\r\nThat's some California Bay Area Lingo... \r\nbrought to you by The E Forty ([E40]) himself... get the book learn the lesson..All others are posers. [please believe]\r\n\r\n",
    "coo": "A shortened more [lazy] version of the word \"cool\". Used when it takes too much [effort] to [pronounce] the \"l\".",
    "blau": "[Somethin] you yell out when you [hella] [kick ass] at something, guy.",
    "jeriko": "[Jeriko] the guy who makes you fall for him so easily and is the sweetest guy you'll ever meet. He's the type to say sorry to a [leaf] if he [stepped on] it but still has a little bad in him. Jeriko is the guy to make you a better person just by looking at him.",
    "kokane": "1. A large Amount of Courage or [Bravery].\r\n\r\n2. A great [Tribal] Warrior or in other words [Cheif] or Warrior",
    "pollaseeds": "[Sunflower seeds], it's a westcoast [thing].",
    "trapp": "Vonn Trapp is living an overly [opulent] lifestyle, typically beyond your financial means.\n\nThis lifestyle includes drinking copious amounts of alcohol, with a cavalier, 'i-don't-give-a-fuck' attitude. But being Vonn Trapp is about being a classy-as-fuck drunk as well, and simply being the life of the party!\n\nTo be Vonn Trapp, you must be classy, fun loving, be respectful, and ruthlessly protective of your mates at all times.\n\nThink Ron Burgundy and [Barney Stinson's] [lovechild]... that is what it is to be truly Vonn Trapp.",
    "cheah": "The [exquisite] word shouted with great force and [intensity] by Sir bakerXderek from the [lands] of YouTube.",
    "snub": "v. describes the action of ignoring, failing to notice, or pretending not to see someone.\r\na person is usually [snubbed] when they are [disliked] or the other person couldnt be [bothered] talking to them.",
    "beefin": "Arguing/fighting, or a [feud] [between friends], family members, enemies or gangs. Sometimes it just means a verbal [confrontation], but quite often leads to violence.",
    "paper": "[Slang] [term] for \"[money]\".",
    "grain": "A term commonly used in the IT industry to describe an [outage] of a service being caused by the [substandard] work of a [sysadmin].",
    "bouncin": "1. [moving] [away] from one [point] to another point\r\n2. doing, going, your well being",
    "bezzles": "[Ice], [jewelry], [bling-bling].",
    "geezy": "The act of being a fucking thug of skis or snowboard refering to people who shred, combining the words gee and steezy, [yadda] mean, sucha s henrik harlaut, [tom wallisch], and lucas [magoon]",
    "phunky": "[PHUNKY] derived from FUNKY, funky being an old 70's word has now been [re-vamped] to mean the same thing but now in punk/skater terms. Used if you think [somethings] good/cool.",
    "breezy": "The word breezy is a combination of the two words which describe a woman that is [easy]. The word \"[broad]\" (slang for a woman) is combined with the word easy [creating] the derogatory word \"breezy.\"",
    "claro": "like [saying] \"Yeah! Let's [do it]!\"",
    "figgaz": "A word created by [the late] great [Tupac Shakur], meaning \"Fake\" [Niggaz]",
    "kels": "Two shots of vodka mixed with [Orangette]. This libation was made famous by Kel [Kimble] from the 1990s hit show \"[Kenan and Kel].\" He was always fuckin' wasted. Why did you think he loved orange soda so much?",
    "otay": "From \"The [Little Rascals]\" [movies].  [Buckwheat] always mispronounced \"okay\" and said \"otay\".",
    "ppy": "-Used mainly in the world of [Neopia](neopets.com).\r\n-Abbr. \"Problems Processing Your Score\".\r\n-Usually associated with anger, because they will give\r\nyou \"[NP]\" depending on points, and when they PPYS you,\r\nyou don't get [the NP].",
    "suttin": "[slang] for \"something\"; [coined] by PuffTheMagicDragon [biotch]",
    "vokal": "[Nelly's] [clothing] [line]",
    "wkya": "We [Kickin'] [Yo' Ass] [Radio].",
    "sv": "Simply a term for \"[Sandy Vagina].\" Invented by [Cartman] in South Park during the \"curse word\" episode. A term to described something in a really [bad mood].",
    "cake": "This is [a lie]! Everything you have been told about [the cake is a lie], do not [listen]. ",
    "slugs": "[Bullets]",
    "buss": "buss is a term used in the \"[aina]\" or in other words the hawaiian islands to describe the state of [being high]/[drunk out] of your mind. Being \"buss\" or \"bus\" relates to being drunk/high for the reason that, if one is \"bus/buss\", they must use a bus or other reliable form of transportation to get home.",
    "mezanmi": "A [Haitian] [expression] for exclaiming [surprise].",
    "grills": "1. One's [personal] [business]\n2.  One's [teeth]/smile\t",
    "slab": "slab stands for Slow Low And [Bangin']. mainly used in the south for any car that is fully customized (ie. sound system, [paint job], [rims], engine, ect).",
    "crist": "Getting [married to] [hide] the fact [you're gay]",
    "gully": "Something from the streets, [gutter], and/or gangsta\r\n\r\nSame as [sayin] 'Hood'(\"I'm [so hood]\") or \"Street\" (\"I'm so street\")",
    "badunkadunk": "a dick-bouncin, dynamic booty, that defies the laws of physics and reminds men why we wanna be dogs or an urban term used to define approval of the [voluptuous] [curvature] of a feminie [rump]. ",
    "beb": "short for \"[babe]\" or \"[baby].\"  can be used to refer to an actual baby, or as a [pet name].",
    "chalupa": "A very tasty form of taco which occurs in and around taco bell. The fire™ brand [salsa] can be combined with the previously mentioned chalupa in order to [augment] the flavor [exponentially].",
    "crissy": "[a force] [greater] than your entire existence; [godly].",
    "neef": "Neef, is a wannabe [illustrator] who attempts to take part in the art of drawing, but really he is a horrible artist. Oliver Age 24 tries to teach everyone who is subscribed to him on YouTube how to draw really good by making video tutorials and drawing TV show characters and stuff really good with 3D effects. Sometimes even [4D] effects. But Neef cannot draw really good. If you have watched Oliver Age [24's] videos, at the end there is a drawing done by Neef. But anyone, I mean anyone, even an Autistic Ed from Ed, [Edd] 'n' Eddy could see Neef has done a terrible job.\n\nAh, Neef...When will you learn?\r\nNeef can also be used to replace other words. In some of Oliver Age 24's videos, Oliver uses the word Neef to replace swear words like in the music video for [Pokémon Master].",
    "swangaz": "[Swangaz] - (Noun) Another way to describe the infamous 84 znc 83 caddillac rims. Brought into the northern market from the South, are a very sought after [commodity] around the state of Texas, and spreading nation wide. Started as a Houston based [status symbol], and is quickly spreading.",
    "thizzle": "A word used by the one and only [MAC Dre] out of [Vallejo], CA.\r\nThe Bay [area's] word for: Being on ecstacy.",
    "wyte": "awesome [fuckin] [rapper] who likes [drugs].",
    "zunga": "noun. a rope tied to a tree branch or attached to the roof in some indoor swimming pools. Commonly known as a [rope swing], people [swing on it] and either just jump off into the water or do tricks or flips off it. The word Zunga originated in a little town called [Powell River] in BC, Canada. ",
    "kel": "Two shots of vodka mixed with [Orangette]. This libation was made famous by Kel [Kimble] from the 1990s hit show \"[Kenan and Kel].\" He was always fuckin' wasted. Why did you think he loved orange soda so much?",
    "zagga": "[A casual] [greeting].\r\n[like Hello]",
    "ants": "A funny, good looking guy, usually young but not neccessarily. Very cheeky and jack-the-laddish. Often intelligent and mature for his age, [quick-witted] especially around people he's just met. The kind of guy you see in a corner at the party telling girls about travelling stories. Like a [party animal] but not as [wacky] or drunk.",
    "doggone": "A [politically correct] [deviation] of the expression \"goddamn\". Mainly used in the southern [United States].",
    "doop": "When Philadelphia received their [MLS] expansion team, the Union, the coach [Petr] [Nowak] asked the supporters, the Sons of Ben, to sing a song after each goal scored by the Union. The song is (Maria) I Like It Loud by Scooter with the DOOP coming in at the chorus.\n\nNow when the Union scores a goal, the entire stadium breaks into song. DOOP is now used in every day language to express joy.",
    "hova": "Its tha [name that rapper],Jay-Z calls himself since he considers himself tha \"God\" of rap.And [Jehovah] is [anotha] name for God.",
    "balmer": "slang of [the city] of [Baltimore],[MD]...",
    "blung": "Blung is a [sacred] plant [pon] which [thy] must prepare in a rolling method, In order to the effects of this herb.",
    "chingo": "From the Mexican-Spanish verb [chingar], meaning \"to fuck\".  Implied meaning is \"a lot\" and translates directly into \"a [fuckload]\".  Usually used with other [Spanish words] in the same English sentence.  Mainly popular with Latinos",
    "collipark": "short or \"hood\" for college park. College park is a little town right outside of atlanta and has been the home/starting place of rappers like T.I. Ludacris, Yung Joc, [MR. collipark] himself, [Jermaine dupri] and the rest of [so so def] recording",
    "bubba": "[Bubba] is a [southern] derivation on the word \"[Brother]\"",
    "swizz": "An [unfair] [deal]; a [rip-off].",
    "poobie": "A word put in someone else's Facebook status to indicate that they have left their Facebook account signed in and [unattended]. It's considered to be a [tame] version of [frape], and can be achieved in a manner of seconds because of its short and simple nature.\n\nIt usually takes the form of \"(name) is [Poobie].\" but variations on the standard [poobie] are often used. It is also used as a verb to describe the action of poobie.\n\nBeing poobied brings shame on the recipient and lets their friends know that they have been stupid enough to allow circumstances in which poobie could occur. It is against poobie law for the recipient to [delete] a poobie, unless it was done in unfair circumstances, e.g. hacking.",
    "horns": "[Horns] of [the devil] made with your [hand]. Such as \\m/"
}