{
    "molly": "Noun: A friend. Molly is highly intelligent academically and will always beat you in tests. She’s committed, a [hard worker], compassionate, independent, dedicated, a great listener, funny, fashionable and above all [picturesque]. Molly is athletic with model body who loves the outdoors and will care and love you if you give her the chance. Molly is one who you can turn to in your time of need, as she is a devoted friend. She offers the best advice and makes sure others are happy before she is. Molly does not pass judgment unless it is due. Molly has a great taste for music. Someone who you can speak to on the phone for hours on end and the conversation never dulls. Molly does wonders in the kitchen. She is a [perfectionist], who sometimes gets caught up in one person or task for a long time. Molly has a beautiful smile. Molly is the kind of girl you don’t want to let go of. You don’t want to break Molly’s heart because her trust never deserves to be broken. She claims she has blue eyes but many would say [hazel] with gold in the middle. During summer her hair is a golden colour turning darker into winter and her smile will brighten any persons day or melt any man's heart. Many things can be said about her but her [true potential] is truly [limitless]. Molly is unique and not easily defined.",
    "swag": "The most used word in the whole fucking universe. Douche bags use it, your kids use it, your [mail man] uses it, and your fucking dog uses it. If you [got swag], you generally wear those shitty hats side way, and your ass hanging out like a fucking goof cause your pants are half way down your white ass legs. To break down the word, it means (Secretly We Are Gay). It is also a word that means to represent yourself/ the way you represent yourself, baggy clothes, shitty hats, small penis and basically a way to say your afraid to [come out of the closet].",
    "tunechi": "[Lil wayne's] nickname. Given to him by his [grand] mother. [R.I.P].",
    "kush": "A [high grade] [strand] of [marijuana].",
    "hol": "[Howling] Out Loud. Used as an acronym to express loud [boisterous] laughter when something is really really funny, unlike LOL that is now [overused].",
    "turnt": "Like [hype] for a [party], or at [the club]!",
    "rozay": "French [Rose] [Wine] or [champagne].",
    "tadow": "A bitter, self obsessed genius who flames 99% of the blogverse. An insufferable puling hypocrite that ruins a thread with his [boarish] trolling behavior, and obvious [double standards]. See also-([Sophist])",
    "sosa": "[fucking] [chief keef] [nigga].",
    "maybach": "A grand old car company initial founded by [Wilhelm] Maybach in 1920 (Maybach himself was one of the founding engineers of Diamler Benz).  The original company produced ultira luzury sedans in Germany until it went bankrupt in 1937, at which point it began building airplane engines for the Nazi [war machine].  The Maybach name has recently been reincarnated by Mercedes Benz as the brand name for its new ultra luxury brand, which currently markets two super luxury sedans, [the 57] and 62, each basing at $300K and $350K respectively.",
    "ballin": "[Ebonics]. \r\n1.) To [play basketball].\r\n2.) Living in affluence/[wealth].",
    "ratchet": "It's a fucking [socket wrench].\r\nThe correct way to use the word \"[ratchet]\" would be, \"Wow, this ratchet is so [useful].\"",
    "stuntin": "High class flashing of your jewelry, money riches etc. Made famous by the [Cash Money] [Millionaires]. A person who stunts would be a \"[stunna]\" usually showing off diamonds, gold, platinum, women, cars and stacks of cash..LARGE BILLS! see \"bling bling\" for an idea of something a \"stunna\" would stunt",
    "ciroc": "vodka brand prepared in FRANCE ,made from grapes,five times [distilled]. the brand is promoted by [renown] artist [P DIDDY] ;)",
    "mma": "Mixed martial arts. A hybrid of full contact striking and grappling styles (muay thai, wrestling, [jiu-jitsu], etc...)\r\n\r\nIn North America, the most popular promoter of this sport is the UFC ([Ultimate Fighting Championship]). In Japan, it is called [Pride FC].",
    "rari": "its the [short] [form] of [ferrari]",
    "chugga": "Chugga Chugga is a form of [hardcore music].  With guitars tuned usually to C or lower, open notes, and [breakdowns].  It is a music to mosh to.  Favorable to [Scene Dippys]",
    "errday": "[A day] full of [errors], when one makes a lot of mistakes.\n\nNot to be confused with \"errday\" as a lazy [contraction] of \"every day\".",
    "purp": "Marijuana that displays [purple] [hairs] and deep [greens].",
    "hunnid": "The plural of [a hundred] [dollar bill]. Something you throw at a [stripper] to let her to know that you are wealthy.",
    "mula": "[money], [cash]",
    "waka": "[The noise] [pac-man] makes when he [walks].",
    "trap": "[The area] where drug [deals] are [carried] out",
    "rollie": "[a cigarette] that you [roll] yourself ",
    "drip": "When your bling is [iced out] but that shit melting from all your [hot bars], you got [the drip].\n\nJust another word for immense swag.",
    "flocka": "[Randomly] [shouting] 'Flocka!' when you hear a song from [Waka Flocka Flame].",
    "flexin": "Flexin is when you [show off] [the stuff] you [got]",
    "ymcmb": "Y=Young\r\nM=Money\r\nC=Cash\r\nM=Money\r\nB=Billionaires\n\nThe combination of [Young Money] Entertainment and [Cash Money] [Records].",
    "strangeland": "It's the fantasy world created by rapper [Tech N9ne] where everybody knows him and he's the creator.\n\nAlso, it's an awesome song off [Tech's] last album \"All [6's And 7's]\".",
    "keef": "Either the [crystals] off dank marijuana buds or [the yellow] [pollen] from the male plants.",
    "smif": "[shoot] myself in [face]",
    "forgiato": "Rims that [boofs] put on [donks] and even the occasional [Ferrari] just so they can ruin it.",
    "lac": "[Short] for [Cadillac].",
    "drizzy": "Someone that falls over a lot and [fucks] up his [knees] and [ankles]",
    "flacko": "a guy that has “[pretty boy swag]” (made popular by other swag rappers like Lil B, Soulja Boy…), and [Flacko] meaning the guy is skinny, because the word flaco means skinny in Spanish, used by [Asap Rocky]",
    "goons": "Known as  [Gangstaz] and [killers].  Partners [who ride] and die together.",
    "dubba": "Any size [breast] [larger] then a [D cup].",
    "melatonin": "A natural pill that not only helps [you sleep] but also gives you more intense [vivid] dreams. It also increases the chance of having a [lucid dream].",
    "nem": "them; some other [people]; [more than] [one]",
    "sprite": "Sprite might be one of the best [sodas] around. Sprite was introduced in [1961] from Coca-Cola after the public wanted something new. Ever since then, Sprite has been showing up in fancy [dinning] rooms and gethos alike. Sprite is the one and only thing that black and white people can share and talk about.",
    "percocets": "Prescription painkiller containing [Oxycodone] and [Acetaminophen] (Tylenol). Oxycodone is the same drug that is in Oxycontin, although the dosages in [Percocet] are much lower. Prescribed for moderate-severe pain.",
    "hollygrove": " Hollygrove a section apart of the 17th ward New Orleans known for it's  [high crime] and [murder rate] but still has some the nicest people in the world, the neighborhood took a hard hit with over 8 feet of water when the 17th street canal broke after [Hurricane Katrina]",
    "novacane": "[numb] to pleasures and [feelings] cause you can [have it] all",
    "pettie": "When someone takes a small subject and blows it [out of proportion]. \r\n\r\nAt times, making something otherwise [insignificant] into something bigger to suit their own [agenda].",
    "sookie": "(adj.) [Australian slang] for feeling [sulky] and complain-y, with connotations of needing [affection].",
    "skrrt": "Noise made when [driving a car] ([drifting]/turning hard) and wheels [screeching]. Also slang used a lot in rap to move away/get away from somebody",
    "poppin": "to get ([something]) [started]",
    "bino": "[Slang] [term] for [bong].",
    "deluca": "When someone you haven't seen or heard from in at least [10 years] sends you a message or [IMs] [you on] MySpace or Facebook.",
    "womp": "Used on [the children's] TV show \"[Recess]\" as a made up word used by main [charactor] TJ to describe anything, can be either good or bad.  In this way to avoid getting in trouble, not cursing.",
    "figg": "1. cool; awesome; great.  Mostly used as a [reply] in a [text message].\r\n2. [The number 8].  ",
    "yawk": "The sound of a bullet shot as defined by rapper, School boy Q. It is a trademark sound made by him, and is sampled in [Kendrick Lamar's] song \"[M.A.A.D]. City\" and is part of his verse in [Childish Gambino's], \"Unnecessary\".",
    "geechi": "[Geechy] (most commonly spelled [Geechee] or less often Geechie) is a name historically given to and associated with the dialect of English spoken by white people of the South Carolina [low country] especially in the region between Georgetown and Beaufort. A typical \"Geechee\" is from a family that has long resided in the area and acquired the dialect and accent in the home. There has been a movement lately to incorrectly include Geechee as a part of the \"Gullah\" dialect spoken by the descendants of African-American slaves in the same region and their associated culture. The [geechee] dialect is sometimes humorously referred to as \"Charlestonese\"sincec the region it is most commonly spoken is centered around Charleston, SC.",
    "swaggin": "[To do] something with [swag] or [style]. ",
    "gbe": "[Glory Boyz] Entertainment. [A rap] group based in Southern Chicago, basically a bunch of thugs. Including [Chief Keef].",
    "haan": "[Fine], usually all [leather] [shoes].",
    "lambo": "[Lamborghini]. Italian sports car manufacturer that also makes furniture, [SUV's] and other tacky [cack].",
    "stunting": "[To stunt] is to [floss] or show off. When somebody's tryin' [to stunt], [the playa] is trying to show off all he's got.",
    "kle": "A real manly man that enjoys [packin] [fat lips] and chews. Likes to fight however throws only punches not kicks. Often very emotional and in tune with feelings. The females cannot resist him.. he is a [babe magnet]",
    "thot": "[A Thot] is a hoe. [Plural]: [Thotties]",
    "trukfit": "1.\n\nTHE\r\nREASON\r\nU\r\nKILL\r\nFOR\r\nIT\r\n2. [Brand] of [clothing] for [skaters]",
    "rarri": "a [ferrari]\r\n\r\nferrariusa.[com]",
    "lean": "To create Lean, a popular drink originated from Houston Texas, you require the following for the original formula:\r\n\r\n-Promethazine w/Codeine VC <- [Sizzurp] (active ingredient)\r\n-Original Sprite Soda <- Mixing ingredient (although different flavors of sprite are now used, such as [sprite remix])\r\n-Jolly rancher candy <- Flavor additive\r\n\r\nPut it all in a styrofoam cup and enjoy. The codeine is mainly responsible for the euphoric feeling after drinking lean. Promethazine causes motor skill impairment, lethargy, extreme drowsiness, as well as a disassociative feeling from all other parts of the body, specifically the stomach and digestive system. If it doesn't have promethazine w/ Codeine, it isn't real [sizzurp].\r\n\r\nThe mixed drink combination known as \"lean\", is normally the color purple, due the added ingredient sizzurp, which is originally a dark [purple syrup]. There are other colors of sizzurp which can be added to create lean, but the purple is the true [sizurp]\r\n\r\nLean does not contain ANY form of alcohol, crushed pills, or other liquids in general. ",
    "ovo": "[October's] Very Own\r\nSaid in [Drake's] song, [Crew Love]",
    "joog": "cheap; a [discounted] [price]. used in [the Bay] Area",
    "llamo": "[My name is]..\r\n                            (In [spanish])",
    "tambourine": "1. n. a drug [peddler]\r\n2. n. your friendly [neighborhood] [drug dealer]",
    "finna": "[Abbreviation] of \"[fixing to]\".  [Normally] means \"going to\".",
    "folarin": "The highly anticipated mixtape from Maybach Music Group's, WALE. Hosted by DJ Clark Kent, 'Folarin' mixtape boasts features from 2 Chainz, [Trinidad James], Jhene Aiko, Rick Ross, [Nipsey Hussle] and production from the likes of The Beat Billionaire, Jake One, [Cardo] & more.\n\nRelease Date: 12/24/2012\n\nTrack List:\r\n1.The Forward by G Mogul (Prod by Aaron [Wess])\r\n2.Change Up (Prod by LG)\r\n3.The Show ft. Rick Ross / Aaron Wess (Prod by No Credit)\r\n4.Let A Nigga Know ft. [Chinx] Drugs / Fatz (Prod by Rico Beats)\r\n5.GetMeDoe ft. 2 Chainz (Prod by Beat Billionaire)\r\n6.Bad ft. Tiara Thomas (Prod by Tiara Thomas and [Kelson])\r\n7.Limitless ft. Scarface (Prod by Jake One)\r\n8.Chun Li ft. Nipsey Hussle (Prod by Cardo)\r\n9.Skool Daze (Prod by [Nottz])\r\n10.H20 (Prod by Joe K)\r\n11.[Street Runner] (Prod by Beat Billionaire)\r\n12.Back 2 Ballin ft. French Montana (Prod by Cheeze Beatz)\r\n13.Cool Off ft. Jhene Aiko (Prod by ToneP)\r\n14.Fa We We Freestyle (Prod by Digi Phonics)\r\n15.The One Eye Kitten Song ft. Travis Porter (Prod by Diplo)\r\n16.Flat Out ft. Trinidad James (Prod by Beat Billionaire)\r\n17.Ji-Dope (Prod by Beat Billionaire)\r\n18.The Right One ft. Hit Boy (Prod by Austin Millz)\r\n19.Money Changes ft. Chrisette Michelle (Prod\r\n20.Georgetown Press ft. Lightshow (Prod by AppleJuice Kid)\r\n21.Never Never Freestyle (Prod by Danny!)",
    "audemar": "a [expensive] [swiss watch].",
    "sabali": "It's commonly known from a song called \"Patience\" from [Damien Marley], and Nas. Sabali means \"patience\". There's a whole phrase that is said in [the song's] hook though, and it goes \"Sabali, Sabali, Sabali, yonkontê Sabali, Sabali, Sabali, [kiye] Ni kêra môgô\". The whole phrase means \"Patience, Patience, Patience, it's what the world is about. Patience, Patience, Patience, let's all join souls\".",
    "tashan": "A pimping...[big al] chain wearing...[hot boi]!!! who's da king o' da [souf]!",
    "yaowa": "Term popularized by gifted Brooklyn lyricist [Joell] Ortiz, a sort of urban version of [Fozzy Bear's] \"[Wakka Wakka]\", meaning (according to Joe Budden) \"absolutely nothing\".\n\nCan be said after any humorous statement,\r\nor whenever the hell you feel like saying it.",
    "blapper": "A type of character created in the MMORPG [City of Heroes].  [Blappers] start out with the blaster archetype, which specializes in offensive prowess and long-range attacks but can't take as much damage as some others.  However, the player then develops the powers of the character to boost their defense and melee attacks.  The player basically tries to create turn the blaster into a [scrapper], a tougher archetype specializing in melee attacks, while still enjoying the inherent offensive bonus of the blaster archetype.  \r\n\r\nOpinion of the effectiveness of such a strategy is mixed.  Some insist it doesn't work, while others insist that they've had success creating such characters.\r\n\r\nThe word is a portmanteau of \"blaster\" and \"scrapper\".",
    "hoodstar": "meaning u are very popular in your hood and u are very known [thru] out ur hood and everyone look at ur like a star...\r\n\r\n[DC]/[MD] SLANG",
    "muny": "[San Francisco's] public transportation system. Consists of [bus's], [trolley] cars, and subway metro trains. Fast, way over crowded at times and hella cheap. ($0.35 for ppl who appear under 17) ",
    "sapporo": "The feeling in [your anus] after consuming copious amounts of [sapporo] itchiban [noodles].",
    "snapback": "a hat with an [adjustable] back. used mainly by [lax bros] to [demonstrate] their lax bro-ness.",
    "thots": "What guys call girls in schools that [send out] [nudes] and porn of themselves. An acronym for That [Ho] Over There.",
    "hodgy": "Considered one of the most insulting things to call an Iraqi person.  The title “[Hodge]” means a person has pursued and completed the highest of Muslim trials.  The word is regarded among the most highly disciplined and devoted.  To be known as Hodge is like what most of us [urban people] would think of someone with “Saint” actually in a person’s title.  American soldiers refer to Iraqis as “Hodgies” because it is literally the cruelest term possible, to take the highest of regarded titles, turn it into a pet name with ‘ies’ and call someone that will never be worthy of such a title is not only a slap in the face to the Iraqi because it is reminding him that he, like most average people, are not truly perfect in his religion, and he will never be close [to Allah], it is also a rip on his heritage and culture. ",
    "gabby": "The most beautiful, amazing, gorgeous, stunning girlfriend that anyone can ask for. Easily lovable in every single way and much more, undescribable unless you actually meet her. Its ridiculous to believe that i even get to be in her presence at any point [in my life]. The feelings you [get around] her are just so amazing, its hard to even talk. Anybody can be your gabby, it doesnt have to be her name, but just know that if you find [a gabby] that is your gabby, she will be yours forever...",
    "bait": "when something is [made] [blatantly] [obvious]",
    "badoom": "Onomatopoeia used to symbolize the sound that the drummer would [make in] a stereotypical stand-up comedy routine. Traditionally, after [the comedian] delivers [the punch] line.",
    "coun": "The [Farsi] [word] for [butt] or ass",
    "blocka": "The sound made by a \"nine\" when being used to \"[pop a cap]\" in ones [rear end].\r\n\r\nAlso associated with [splitting wigs].",
    "cougar": "An older woman who frequents clubs in order to score with a much younger man. [The cougar] can be anyone from an overly surgically altered [wind tunnel] victim, to an absolute sad and bloated old horn-meister, to a real hottie or milf.  Cougars are gaining in popularity -- particularly the true hotties -- as young men find not only a [sexual high], but many times a chick with her shit together.",
    "balenciaga": "Over [priced] [shit]",
    "krizzle": "verb\n\n1 : to make an item partially inoperable by reckless misuse\r\n2 : to botch or [bungle] an event by acting with wanton disregard of another's rights\r\n3 : to remove value from something in otherwise good condition\r\n4 : to dismiss one's own bad behavior with a [fallacious] [self-referential] attitude\r\n5 : to badly mess something up",
    "syd": "[The most amazing] girl one will [ever] [meet]",
    "pacquiao": "The greatest [boxer] in the [whole entire] world. reigning Super [featherweight] champion! ",
    "leggo": "The most unintelligent way to say \"Let's Go.\" [Abbreviations] are supposed to actually be shorter and easier to say than the original version. Not the same exact number of syllables. If you use this phrase other than to make fun of it, your IQ must be extremely low, or you must be trying entirely too hard to seem \"cool.\" Please stop people. You sound stupid. [Lego] is a building block for children. Or the commonly [kn] own [advertisement] for [Eggo] waffles. The phrase \"leggo\" is just another example of a piece of shit that the rap community has given to popular culture. When rappers invented this word, they were thinking \"[Hmmmm], how fucking stupid can we sound?\" And a bunch of idiots all over America fell for it. I am aware that this is not the real origin of the word, but that's besides the point. Point is, it's retarded; don't use it.",
    "liv": "Liv is very beautiful,athletic,smart,hilarious,caring, and friendly. She is a [loyal girl] and prefers guy [bestfriends] than boyfriends. She loves to make people smile even though she may be [dying inside]. Liv makes friends easily and she is a social butterfly. She is super fun! If you hurt her friends, she will hurt you. She's a great person! ^o^",
    "pistachio": "To refer to a member of the opposite sex in conversation when such discussion may be considered overly discriminatory or sexist when being [overheard]. Can refer to the [USDA] system of grading for pistachio nuts and [shells] (i.e. U.S. Fancy, U.S. Extra No. 1, U.S. No. 1, and U.S. Select).",
    "basquiat": "when a guy walks out of a [public restroom] with [the paper] [toilet seat] cover hanging from the back of his pants",
    "jizzle": "The indeterminate [drizzle] of [semen] that follows [ejaculation].",
    "lam": "to run, sometimes follows \"on the,\" meaning \"[on the run].\" Used by   thirties-style [gangsters], the same ones who said things like \"Let's [case the joint], see?\"",
    "piru": "[Piru] - a street in Compton, and also the neighborhood gang, which merged with the Bounty Hunters, [Brims], and Piru Crips, and other various small neighborhood gangs to form the [loosely affiliated] gang (to counteract the overpowering Crips) which is now known as the Bloods",
    "skee": "skee (or [skee skee skee]) is not [a whore], slut,or woman at all  it is semen or cum and the act of [shooting] it on a chick.",
    "woke": "A state of perceived intellectual [superiority] one [gains] by reading The [Huffington Post].",
    "dmv": "This is the DC metro area. [DMV] stands for DC,Maryland,Virginia. The whole DMV listens to [gogo] music which originated in DC. We love northface gear and [mambo sauce] in chinese carry-outs. We rep our hood to da fullest cuz aint no other place like us anywhere in the US. Our whole swag and slang and music and clothes is different from everybody else. I can go on and on bout us but i'm not.",
    "lit": "When [something] is [turned up] or [popping] ...",
    "phantom": "When a man has anal/doggystyle sex with a chick facing a window then [trades] places with his buddy who is hiding in the room without the chick realizing. The guy then proceeds to go outside and wave at the chick who is [looking out] the window. She then asks herself \"If he's out there, who is [fucking me]?\"",
    "brick": "[a pound] or [kilogram] of any drug (item requires [clarification] from speaker as to the amount intended)",
    "rolls": "Used to [describe] the [effects] of [Ecstacy].",
    "chapo": "Joaquín Archivaldo Guzmán Loera, born either 25 December 1954 or 4 April 1957 is a [Mexican drug lord] who heads the Sinaloa Cartel, a criminal organization named after the Mexican Pacific coast state of Sinaloa where it was formed. Known as \"El Chapo Guzmán\" for his 5 ft 6 in stature, he became Mexico's top drug kingpin in 2003 after the arrest of his rival [Osiel] Cárdenas of the [Gulf Cartel], and is considered the \"most powerful drug trafficker in the world\" by the United States Department of the Treasury.",
    "prhyme": "The [hashtag] used by people who are [illiterate] or trashy at their very [core].",
    "thim": "a woman with a [slim] [body] and [curves]",
    "wiz": "to [wee], [pee], or [urinate]",
    "errthang": "anything [and everything] just like [everything], having or [getting] everything",
    "mane": "[Alternate] [pronounciation] of [Man].",
    "tron": "a groundbreaking film made by Disney in 1982 featuring a mixure of live action, Ink, paint and [cel] ([IPC]) animation and some of the longest sequences of [CG] animation ever used up until that point",
    "dougie": "[Swag], [Swagger]\r\n\r\noriginated in [Dallas]",
    "miyagi": "The act of jumping a [fence] and beating the ass of someone at least [8 inches] taller and [50 pounds] heavier than you while wearing sandals. ",
    "cuffin": "WHEN YOU DONT WANT TO [SHARE] A [MATE] WITH ANYONE [ELSE].",
    "balmain": "Greatest Australian Rugby League team of all time. Began in 1908 in the New South Wales Rugby League competition, the club would win 11 premiership titles during its professional existence. Unlucky to have lost back to back in 1988 and 1989, as they fielded such club legends as Wayne Pearce, Gary Jack, Paul Sironen and Benny Elias.\n\nThe club was severely fucked by the onset of the Super League fiasco, which enabled the shit cunt [Brisbane Broncos] to steal a fuckload of money from many NSW foundation clubs. Became the mighty [Wests] Tigers in 2000 as a joint venture with the equally legendary Western Suburbs Magpies. Balmain Tigers, you may be out of [top grade] football, but we will never forget.",
    "clicquot": "Veuve Clicquot Ponsardin is both a champagne house in Reims, France, and a brand of premium champagne. Founded in 1772 by [Philippe] Clicquot-Muiron, Veuve Clicquot played an important role in establishing champagne as a favored drink of [haute] [bourgeoisie] and nobility throughout Europe.\n\nPremium champagne gaining popularity in the hip hop community as of late.",
    "extendo": "An intermediate-force weapon for law enforcement and security professionals, used to gain control over assaultive subjects. [The baton] is a cylindrical shaft that contains [telescoping] metal pieces that lock into each other when expanded. When swung, the extended baton can deal massive damage due to the [kinetic energy] emitted from its solid metal tip upon striking a surface. Most strikes are done on large muscle areas of the subject in order to avoid permanent injury. Expandable batons come in various sizes, including 16, 21, 26, and 31 inch when extended. Synonyms: telescope baton, extendable baton",
    "hublot": "A swiss high end watch maker. [Hublot's] most common watch - [the Big Bang], is mostly owned by big ballers. Sadly, it is commonly replicated, therefore tools buy the [replica] to try to look cool.",
    "hunchoz": "[One hundred]",
    "majik": "[Slang] [writing] for [Magic]. ",
    "plu": "People Like Us.  A [subtle] [reference] to people of the same socio-economic [class].",
    "skert": "When you dont agree with something that someone says, or if someone says something in which you think is a \"joke\". This word is also applied when someone says something DAMN WRONG and you feel [the need] to [emphasize] the [wrongness] of it.",
    "tgod": "Famous rapper Wiz Khalifa came up with this term. TGOD stands for [Taylor Gang Or] Die, witch means; you either join his gang named \"[Taylor Gang]\" or [go kill yourself]. This can be heard mostly in his latest mix-tape \"Burn After Rolling\"",
    "kd": "Acronym for [Kraft Dinner], the Canadian version of [Kraft] Macaroni and Cheese.  It's called [KD] in Canada, because Canadians consider this to be an entire dinner.  Whereas in America, we consider it a side dish.",
    "lum": "Scots word for [Chimney] or [flue],allows the [reek] to exit a house!",
    "cinnamon": "The sometimes spicy and [powdery] [stuff you] put into sugarless food so it doesn't taste like [cardboard]. It's technically not sugar, so why not?",
    "idi": "[Russian] insult that literally translates into \"go to a dick\" and is used in the same context as [the English] term \"[fuck off]\".",
    "birkin": "Premium math courses that target children of the rich and the famous, who secretly don’[t mind] being seen by others as they drop their kids at [enrichment] centers and come back to fetch them after their [shopping spree].",
    "prol": "Abbreviation for [Proletariat], the [Soviet] worker class, used to refer to someone crude, common,  or of lower standing.\r\n\r\nAlso used to classify someone following the \"[herding]\" tendencies of pop culture or fashion.",
    "wobble": "A sensory [transmission] which causes one's body to [teeter], rock or lean repetitiously.  A sensation caused by listening to certain styles of [Drum and Bass] or Dubstep music.   ",
    "mek": "A characterised [string] of variables [designated] to [represent] any imaginable noun, verb, or adjective.",
    "snow": "something that is radical, cool, or otherwise awesome. something that is snow is generally the shit, being [top score], [bitchin], etc. the word is derived from the fact that snow is generally off the hook in its beauty, power, and [pimpery]",
    "bomaye": "it means \"Ali kill him!\". At the [Rumble in the Jungle] in 1974, when Muhammad Ali fought George Foreman, the crowd was pro Ali, so they were shouting \"Ali [boma] ye\" (boma = kill; ye= him) but today many English speakers misspell it as bumaye or [bomaye]. However, it's not one word, it's indeed two words.",
    "hydroplaning": "1. The uncontrolled movement of an automobile when the tires loose [traction] with the road and move on a low [friction] surface of water; 2) [A fuck up].",
    "berkin": "[v-] [the act] of [masturbating]",
    "bool": "[a word] [bloods] use, it's [basically] \"Cool\" with the \"C\" replaced by a \"B\"",
    "cooly": "Originally used to define indentured labourers from Asia (e.g Chinese railway workers in the U.S. & Canada, or [East Indian] [sugarcane] workers in [Guyana]). Now used in the Caribbean (primarily Guyana & Trinidad) to refer to anyone of East Indian origin.",
    "ebt": "Acronym \"Eat Better Tonight\".  Actually stands for \"Electronic Benefits Transfer\", which is the current method of distributing [food stamp] benefits.  Many \"EBT\" cardholders are often seen purchasing high end food items like live [seafood], [high grade] cuts of meat, etc.",
    "fuckboy": "how to spot a fuckboy:\n\n- white nike tube socks with his [adidas sandals]\r\n- he wants to play 20 questions (!!!!!!!!! do not play !!!!!!!!!!! especially if there’s a “;)” involved)\r\n- relies on his mom but doesn’t respect women\r\n- looks like he just read one of [jaden smith]’s tweets in all of his selfies\r\ncan’t [find the clitoris]\n\nfuckboys come in all shapes and sizes and results may vary but when he a fuckboy…he a fuckboy…and u will know",
    "glang": "Glaaang- noun- The positive recognition of a [sexual inuendo] culminating in a hyperbolic gesture of excitement/ arousal (i.e. a [hand shake] or simply speaking the word \"[glang]\")\n\nGlaaang- verb- (1)To call attention to an inadvertent sexual inuendo. (2)To be sexual (3) To simulate a vagina with a hand shake gesture (4) To have sex (5) To have oral sex (6) To have sex-related swagger (7) To reach climax... See more\n\nGlaaang- adj- Possessing attractive physical attributes; eye pleasing. syn.- sexy\n\nOrigin: 2009-2010 (from the hood) pre fix: gla- gulliness, swag; suffix: ang- booty, ass, pussy.",
    "grigio": "Italian sweet [white wine] made from [pinot] [grapes]",
    "hunit": "A slang [version] of the word [hundred], [100]",
    "percs": "Street name for the prescription [painkiller] [Percocet]. Generically known as [Oxycodone].",
    "semicolon": "A [programmer's] [bane]. Required by most programming langauges to seperate commands. The semicolon will usually render an entire program useless and force [the programmer] to search every line for that goddamn semicolon.",
    "truk": "an acronym originally used and created by [Lil Wayne] meaning \"[The reason] you [kill for] it\"",
    "twon": "[Twon] has numerous definitions all arising from a scrub NYC [Chinatown] posse. Here are two:\n\n1. An [ugly asian] girl\n\n2. A bunch of weak ass asian dudes",
    "bueno": "An American expression for \"not good\". [Bueno] means good in Spanish but avoid using this expression in front of anyone who actually speaks Spanish as it's not grammatically correct and people will instantly know that you are an American trying to look [cultured]. Proper Spanish for \"not good\" would be \"No está [bien]\"",
    "saks": "aka [dick suck]\r\nterm used [highly] in [Southern California]",
    "ham": "[Acronym] for [Hard] As a Motherfu@#r",
    "dela": "[Russian]\r\nMeaning \"[What's Up]?\" or \"[How are you]\"",
    "dida": "The saying of 'hello' according to [Crystal] for [The Urbz]: [Sims] in the City.",
    "errt": "[Used] [to show] [retardedness]",
    "lambos": "[Lamborghini]. Italian sports car manufacturer that also makes furniture, [SUV's] and other tacky [cack].",
    "danny": "an amazing guy.\r\n[a danny] can be defined by 5 words;\r\nfunny, cute, unique, impressive, & [huggable].\r\n[danny's] are people you can't help but love.\r\n& who could turn down a danny?",
    "tut": "its [jst] a noise you [make with] ya tongue. [its like] when you do something wrong oooor somthin silly",
    "ortiz": "Probably the biggest [steroid] user [Red Sox] history. \r\n\r\nHis body is so fucked up from 'roids to the point that he can't even play [first base].",
    "vvs": "Very, very slight (inclusions). Referring to the [clarity] of a diamond. The fewer the inclusions (traces of carbon) the [rarer] and more expensive [the stone] is.",
    "moolah": "Another [way] of [sayin] $$$[money]                                                  .",
    "clancy": "lazy obnoxious [smelly] drunk irish [hobo] with no place to stay.\n\noften relating to a [loosey goosey] vagina.",
    "hunnids": "The plural of [a hundred] [dollar bill]. Something you throw at a [stripper] to let her to know that you are wealthy.",
    "patron": "[Patron] Añ[ejo], an expensive brand of [tequila].",
    "amok": "amok a-mock: an [aggresive] activity tends to ruin everything.\r\nThis word comes from [southeast asian] language, bahasa Indonesia (Indonesian language) : \r\n[amuk](verb),meng-amuk",
    "beca": "An extremely [fit] girl. One of [incredible] [beauty].",
    "claustroflowbic": "[The fear] of having too much [flow] for small spaces. popularized by rapper [hodgy beats].",
    "doms": "Short form for: [Delayed] [Onset] Of Muscle Soreness\r\n\r\nWhen we work out at the gym well enough to tear the tiny fibres in our muscles (which is the overall intention: when the the [micro] fibres in our muscles get rippd from pushing our limits in the work out, our muscles feel pain about 24-48 hours later, lasting for about 48-72 hours. basically our muscles are goin like \"wtf did he just do to me? i better get bigger so this doesn't happen to me again!\" which [ofcourse] it [dus], because we increase the weight in the next workout and go even harder.. and the cycle goes on..)",
    "gyah": "The term used most commonly as an [uncontrollable] [response] to the act of gyration against one's [hip] area.",
    "jodye": "Jodye is a very great and beautiful person. she is an amazing friend with [Giselle]. She is funny and has a amazing personality. She would do anything for [a best friend]. Singing is one of her favorite things to do. There are so many other descriptions of how smart and funny and just [wonderfull] she is. She's like an angel",
    "kadoosh": "An exclamation of [victory] or [superiority] . . . in other words complete [pownage].   ",
    "klusterfuk": "1. \"Growin up fucked up.\"\n\n2. \"A mix of all the stuff religion has to offer, boiled up till the bullshit [burns off], [all that's] left is love.\n\n3. \"You can't say you always [rise above] the trivial shit in your life cause you don't, sometimes your ego won't allow you to walk away.\"\n\n4. \"You've done a lot of drugs, but in the end, as long as your aligned with love, you KNOW your livin righteous.\"",
    "krit": "The [coolest] person you will [NEVER] [meet]!",
    "lituation": "[a situation] that [is lit]; a [lit] situation",
    "ludaversal": "The location [Snoop Dogg] takes his \"bitch,\" [subsequent] to \"hitting her booty first.\" He is rumored to have been drunk at the time of [declaration].",
    "sls": "Abreviation for the [swinger]/[alternative sex]/[lifestyle] website SwingLifeStyle.",
    "tadoe": "[another word] for [tada]",
    "yutes": "[Jamaican] slang for [youth],young person or [child].",
    "madoff": "A [cock sucking] scumbag with [no regard] for [the human race].",
    "fredo": "To bang 2 cocktail waitresses at the same time - adapted from \"[The Godfather]\" and brought back by Trent ([Vince Vaughn]) in [Swingers].",
    "hunned": "[short] for [honey], an [endearing] term ",
    "migo": "A man of [hispanic] or latin decent;It is mostly used in [the D].C. area by black people describing a hispanic or [latino] man.",
    "syrup": "[Promethazine] with Codeine Cough Syrup, manufactured by Alpharma Inc.  Each 5 mL [tablespoon] contains 6.25 mg [promethazine] hydrochloride and 10 mg codeine [phosphate].  Codeine is an opiate, a natural substance found in the opium poppy.  However, it is rare and thus most medicinal codeine is created via the methylation of codeine (the addition of CH2).  In Houston, Texas, it s a very popular beverage; the syrup is traditionally mixed in with soda and jolly ranchers.",
    "ollie": "[Jumping] over something with a [skateboard].  Usually accomplished by pushing on the tail of the board and [jumping] up with the board stuck to your feet.",
    "gush": "[women's] [secretion]",
    "phantoms": "When a man has anal/doggystyle sex with a chick facing a window then [trades] places with his buddy who is hiding in the room without the chick realizing. The guy then proceeds to go outside and wave at the chick who is [looking out] the window. She then asks herself \"If he's out there, who is [fucking me]?\"",
    "kiv": "[Keep] in [view]\r\n(used as [a short] form)",
    "otf": "[Acronym], [meaning] \"Only [the family]\"",
    "tk": "[Team Killer] n.\r\nA person who engages in intentionally or unintentionally killing teammates in online games.  [TKs] are either unskilled or are trying to ruin the gaming experience for others.  The latter can be summed up by the [Battlefield 1942] term smacktard.",
    "vacay": "[vacation], abbreviated, derived from the first two [syllables]\r\n\r\nMentioned in the movie [Legally Blonde].",
    "exes": "1) Someone who will have sex with you when [nobody] [else] will\r\n\r\n2) Someone who won't [speak to] you even when everyone else will",
    "goonies": "1. ya niggas\r\n2. your friends\r\n3. [ride with you] till tha [wheels] [fall off]",
    "deuces": "when someone holds up [two fingers] symbolizing \"[peace]\" when leaving an [establishment], \"deuces\" is often said. ",
    "ocho": "1. Ocho originated from the Spanish word for eight. However in some Spanish speaking ghettos, men who carried guns were referred to as [Ochos] instead of [nines]. The term caught on quick and spread like [wildfire].\r\n\r\n2. A term for something that is cool, the roots are quite unknown, but it began in D.C. and spread West of there. The use of the word can differ, it can be a term of endearment to a term of hate.",
    "chiddy": "New, Young, Breakout Artists that will blow your mind! [Chiddy] Bang is a Philly based duo comprised of Chiddy (emcee) and Xaphoon Jones (DJ/producer) who combine elements of indie and electronica with some good al fashioned “spitting”. Chiddy Bang are university students; [Chidera], Noah, Zack and Pat (professionally known as Proto, Xaphoon, Fresh Kid Z and Tennis Brown).Currently attending Drexel University (Philly) Chiddy approaches Hip-hop in a whole new fashion. With the collaboration of well known Indie-rock beats and [Chiddy's] smooth beats on top of it their true talent really shines. These young and extremely talented college students know exactly what to bring to the table in this new decade. Just wait, they gonna be huge!",
    "chiraq": "word to describe [chicago] because of its violent history and crime [rates] one of americas [mos] dangerous cities",
    "django": "1. The best thing a [web developer] can use to make a web site using the best programming language in the world - [python].\r\n2. A [jazz musician] from Europe who played guitar with 2 fingers because he got burnt in a fire.",
    "gotem": "[Gotem] is primarily used as an interjection.\r\n\r\n1. Used when you succeed in [pranking] someone.\r\n2. Used when you win an argument and/or makes the one you are [arguing] with look like a fool.",
    "heema": "The modern day equivalent of a ninja, slipping in-between the Light and Shadows at will. This person harnesses the power of Light & Dark, [Yin] & [Yang] and is always in a state of [Zen].",
    "peacoat": "[The ultimate] piece of white-person fashion. Though known as a woman's [jacket] by many, it was actually worn by [sailors] for many years.",
    "piggie": "1. [Fat kid] with glasses who gets smashed by a large bolder in [the Lord] of the [Flies].",
    "salamu": "is an [Arabic] language greeting used in both [Muslim] and Christian [cultures]. It means \"Peace be upon you\"",
    "twitpic": "a picture [sent] through [the social network], [twitter].",
    "vate": "vate is [the same] as [wack] but more [forceful].",
    "whitter": "1.) [Talking] consistently about [nothing] of any [real] importance or relevance.",
    "stone": "A weight measurement ([chiefly] european) where one \"stone\" is equivalent to 14 [lbs]. or roughly 6 [kgs].",
    "chug": "Racist [slur] for [Native Americans]. Derived from the [inference] that \"all\" Native Americans drink \"Lysterine\", and \"Lysole\"",
    "python": "[Python] is a powerful high-level interpreted language. [Python's] design is notably clean, elegant, and well thought through; it tends to attract the sort of programmers who find Perl grubby and [exiguous].",
    "yop": "The supreme syllable of [primal] self-affirmation and/or -acceptance, suitable for shouting from mountaintops, [astride] a wrassled bear, on [the verge] of battle against immeasurable odds, in math class, or over the roofs of the world.",
    "cone": "1. Metallic cone shaped item in a bong or [pipe that] the weed is burnt in. Another word for a 'bowl'.\r\nReally means 'cone piece' or [CP]([abrev].)\r\n2. Process of smoking weed from a bong.",
    "meenie": "a person who chooses their love interests by playing the eenie-meenie-miney-mo game. This person is considered a player or also someone who has no [concern] for other people's feelings. They choose who to like by saying eenie-meenie-miney-mo. also of the title a song by [sean kingston] and [justin bieber]",
    "bronco": "You start by going [doggy style] and then just when she is really enjoying it, you grab her tits as tight as possible and yell another girls name. This gives you the feeling of riding a wild bronco as she desperately tries [to buck] [you off].\r\n",
    "gri": "A currently unpopular GameFAQs word.\r\n\r\nNot allowed: g-r-i-s, gr*s, g***, 9|-1$, [girs], gryeeeas, grizznizz, **** (rhymes with \"bris\") \r\nAllowed: ****, ****ed, ****ing, [g'ed], [g-word]",
    "alaykum": "is an [Arabic] language greeting used in both [Muslim] and Christian [cultures]. It means \"Peace be upon you\"",
    "damier": "Its not any [mirror], its [da] mirror",
    "figueroa": "1. To be a real [pimp].\r\n2. To act \"[fly]\".\r\n3. To [come out] cool from a difficult situation.",
    "luckett": "Former member of the group [Destiny's Child] who is from [Houston],Texas. Also the HOTTEST one in the group right next [to Beyonce]. She has a great voice and a great body to go with it. Destiny's Child sucks without her. Anyone that says she sucks is a fuckin LOSER!",
    "mort": "Anything used to describe someone who lacks sense [of life], looks [dumbfounded], and has only a [limited] ability to learn and understand. Often excluded from society.",
    "margiela": "Non-traditional designer wear by Martin Margiela who is a Belgian [fashion designer].\n\nWord made more famous from [a Kanye West], Jay-Z – N*[ggas] In Paris song.",
    "rocko": "A hilarious [cartoon] that for some [gay ass] reason got [canceled]. But it was one of the funniest ever.",
    "nipsey": "Born in Los Angeles, California, an [Eritrean] ([East Africa]) Nipsey Hussle aka [Ermias] Ashgedom rose to stardom in late 2008 when he went on tour with fellow west coast artist The Game. He owned a clothing shop in LA, before selling all of his possessions to set up a recording studio. He is expected to release an album in the summer of 2009; his first two singles debuting in early 2009. He is a member of the Rolling Sixties Crips, one of the most respected sets in California.",
    "bezel": "A [groove] to hold [gems] or [diamonds].",
    "bowls": "the part of a marijuana (weed, pot, [ganja], etc.) pipe in which the marijuana is placed (packed) to be smoked. it may have a little hole ([carb]) on the side of it, which you cover while you are [inhaling] the marijuana smoke while holding the whole pipe and smoking.",
    "camaro": "A beautiful, ungodly fast car that can be picked up for about $8000 and will shit on your eurotrash wannabe [porsche's] or [Jags] and your homo-erotic ricer club boyz.\r\n\r\nhands down the most [bang for your buck]",
    "fleece": "Being [cheated] out of [belongings]",
    "actavis": "The main ingredient in the Purple drank that originated from Houston by [Dj Screw] called Lean or Drank. Usually made from Sprite, [Actavis], and [Jolly Ranchers] mixed together with ice in a styrofoam cup inside a styrofoam cup, aka, adouble cup.",
    "bachs": "greatest [composer] that ever walked the earth... to think that people like nirvana and [greenday]... [tut tut].",
    "belichick": "verb: To cut the sleeves of a [garment], with complete disregard to [evenness], [uniformity] or style.",
    "chordaroy": "the snow that is left on the mountain after they [groom] it. looks like the pattern you get from chordaroy.  totally [nectar] to [shred].",
    "forges": "1.Something kids in school do often when they [forget] to get their parents to [sign] something. \r\n\r\n2.Something kids in school do often when they didn't forget but simply didn't want their parents to see something. \r\n\r\nOften, they use a friend with good [penmanship] to do it for them.",
    "forgiatos": "Rims that [boofs] put on [donks] and even the occasional [Ferrari] just so they can ruin it.",
    "gretsky": "this is when  you are having sex with a girl and one of your [buddy's] is hiding on the floor for your [cue] with a pillow in his hand.. then when you say now! he pops up and [whacks] her with the pillow . then you and your buddy scream wwwwaaaayyynnneeee gggrreeettssskkkyyy!!!!",
    "joogin": "To [make moves], to get out and [hustle], to grind, to work hard and have a good [work flow].",
    "juggalos": "a [juggalo] is a follower of [Insane Clown Posse]. they tend to be radically devoted to said band. from what i hear, they are NOT ALL psycho, white trash, [pot-head], ignorant, ill informed bigots. but the many that i have had the pleasure to meet ARE. ",
    "keloid": "Big [ball] of [dirt] on any part of you [skin] that disturbs others around you",
    "millzy": "Canadian in origin;often used to describe a very confused and immature boy whose guy friends tend to get a little too close to each other, all the while maintaining claim to their [heterosexuality]. Cute, yet deceiving, he will invite you up and in, and he will [get it up], but just don't hope you'll [get it in]. Also used to describe the one that totally dissed you, yet you can't be angry at.",
    "neke": "1- Southern [pronounciation] of [Naked]\r\n2- Naked and [up to no good].",
    "nudie": "A male nudist, especially at a [nude beach], [clothing optional] [hot springs], etcetera.",
    "salley": "[John Thomas] [Salley] (born [May 16], 1964 in Brooklyn, New York) is a former professional basketball player in the NBA.  Salley is the first player in NBA history to play on three different championship-winning franchises.\r\n\r\nJohn Salley is now a regular guest on, \"The Best Damn Sports show\" where he consistently makes himself look like a douchebag.  Although he was a more than adequate basketball player, hey may suffer from down syndrome.  Recently his heterosexuality has come into question as well.   ",
    "shanti": "The [sanskrit] word shanti means peace. It is a common word used in [buddhist] mantras and closing of buddhist ceremonies and [prayers].",
    "skooly": "A [school bus] that has been purchased by a private owner and converted for some purpose other than [hauling] people around, such as RVing. Can be a very economical, cost-efficient means of obtaining an [RV].",
    "swolely": "[Extremely] [muscular] or [buff].",
    "woadie": "Something a female can call her female friends [in a way] which is similar to the word [woes], Beyoncé has used the word [woadies] in her song \"Sorry\"",
    "wookiees": "1. Fur-covered beings native to the world of [Kashyyyk]. Made famous by the mighty [Chewbacca].\r\n\r\n2. The correct spelling of [wookie].",
    "yopper": "slang term for the slang term \"[chopper]\". made popular by rapper \"[plies]\" a Florida rapper. An ak-57 or similar automatic [rifle] that can be attained on the streets."
}